{
    "Alliance": [
        "Alliance Leading Change for Everyone. KEY POLICIES. Reforming the Assembly and Executive so no one party can hold us all to ransom. Delivering an improved financial settlement for Northern Ireland that properly reflects our relative need and allows investment in our public services and economy. Revising fiscal rules to account for the costs of environmental inaction and to enable investment in climate action. Creating a Green New Deal to decarbonise our economy, protect workers, tackle fuel poverty, and create thousands of jobs. Repairing the UK-EU relationship, including negotiating a comprehensive Veterinary Agreement and better promoting dual market access under the Windsor Framework. Securing dedicated funding for integration, early years, and early intervention projects as a successor to Fresh Start. Supporting families with childcare costs by demanding more generous tax relief and the creation of a new childcare strategy for Northern Ireland. Advocating for a fair, welcoming, and effective immigration system that upholds human rights and meets the needs of our economy. Reforming UK democracy by scrapping the Tories’ anti-protest laws, First Past the Post and introducing votes at 16. Championing human rights and the rule of law domestically and internationally. Alliance, it adds up for Everyone. LEADER’S FOREWORD, Naomi Long Leader of the Alliance Party. This election is a chance not only to remove a negative, destructive Conservative government but also to hold to account those local politicians who propped up, supported and backed some of their most divisive, regressive policies. We have a chance for change. But to make that change happen, you have to help us deliver it. On Thursday the 4th of July, you have the opportunity to make a positive change to your life and the lives of everyone in Northern Ireland. To positively influence the issues that matter to you most. To support a united community and reduce division in our society. To ensure you have positive representation at Westminster, committed to a more prosperous and fair society for everyone. Together, we can lead that change. Your support plus our commitment to delivery equals a brighter, more optimistic future for everyone. If that’s the sort of leadership you want, play your part. On July 4th, Vote Alliance. We stand ready to expand our team in Westminster, returning Stephen Farry alongside more Alliance MPs.",
        "Building on our successes in the 2022 Assembly election and local government elections last year, we know that people want strong Alliance representation at all levels of government. Alliance is already leading change on better health outcomes, making our communities safer, expanding inclusive education and delivering affordable childcare. We are working to combat climate change, promote a cleaner, greener environment and to create a vibrant and dynamic economy. In this Westminster manifesto, we have set out our policy priorities for the next five-year term. We have focused specifically on those matters over which Westminster has direct control or influence. This isn’t a stand-alone document – to get the fullest picture of how Alliance plans to deliver better; it should be read in conjunction with our Local Government and Assembly manifestos and our policy documents on Childcare, Institutional Reform and our Green New Deal. Crucially, we can use increased influence at Westminster to unlock a fairer financial deal for Northern Ireland and advance reform of the Assembly and Executive so no one party can collapse things ever again. Fairer funding and stable institutions add up to more sustainable politics and public services – a brighter future for everyone. Alliance is growing as more people recognise that a divided society means less for everyone. The cost of division means hundreds of millions of pounds less to invest each year in what really matters to you. DEPUTY LEADER’S FOREWORD, Stephen Farry Deputy Leader of the Alliance Party. I have been steadfast in defending Northern Ireland from a hard Brexit. I consistently opposed destructive unilateral actions from the Conservatives and the DUP, which would have severely damaged our economy. Instead, I have worked to provide practical solutions to a range of problems, and build a closer relationship between the UK and EU will remain a major priority in the forthcoming Parliament. As the leading advocate for reforming Northern Ireland’s political institutions in Westminster, I have worked tirelessly to ensure that we never again face a situation where they collapse, leaving a political vacuum and long-term damage to our economy and public services. I have consistently stood up for all our rights, civil liberties, and the rule of law, pushing back against divisive and toxic Tory rhetoric, and opposing regressive legislation. The Alliance Party recognises that trust in politics is crucial for an effective democratic society.",
        "I am determined to help restore that trust by promoting transparency, accountability, and integrity in public life. I hope to be returned to Parliament with colleagues so that we can build on this success, using our influence at Westminster to make Northern Ireland a better place for everyone. It has been my greatest privilege to represent North Down in Westminster over the past four years. My dedication to serving the people of North Down has been unwavering and I am proud of my track record: delivering on behalf of my constituents and making their voices heard. My small team and I have consistently punched well above our weight and achieved a great deal in this Parliament. I have used my platform to tackle crucial issues facing Northern Ireland and beyond, in line with the Alliance Party’s vision of a shared and integrated society, ensuring fairness, inclusivity, and prosperity for all. I led the charge in securing the £3.3 billion financial package for Northern Ireland, providing much-needed relief to support our public services and economy while continuing to advocate for sustainable, long-term solutions. I have championed calls for the UK Government’s fiscal rules to adopt a more long-term approach to investment, recognise the indirect costs of environmental inaction, and unlock essential funding for public services. The Alliance Party has pioneered the concept of a Green New Deal for Northern Ireland, aiming to create new green jobs, promote social justice, and save our planet. EXECUTIVE SUMMARY. 1 LEADING CHANGE FOR NORTHERN IRELAND. Northern Ireland has transformed in many ways since the signing of the Good Friday Agreement in 1998. But while our society, our economy and even our politics have evolved, our institutions have not, and they are now holding back progress. We believe: • Northern Ireland deserves better than stop-start politics. Our institutions should be reformed to prevent any one party from holding them hostage ever again. • In a society for everyone, underpinned by our shared values of equality, respect for diversity and interdependence. Funding should be released for key projects such as integrated schools and early years investment that will help us build a shared future. • That justice should have no time limit, and we support those seeking truth, justice and acknowledgement for the events of the past. The Legacy Act should be replaced with an alternative that has the support of victims and local parties.",
        "2 UK PUBLIC FINANCES. Public services have been squeezed beyond recognition and the UK’s public finances are in a very bad place. Without reform, current UK fiscal policy is inhibiting investment, reinforcing climate inaction and storing up environmental, social and financial crises for the future. We want to see: • Changes to the Fiscal Rules, so the impact of public spending decisions on the UK’s overall asset base (or wealth) is reflected, rather than just its impact on debt. This would better capture and reflect the costs associated with climate inaction, unlock vital investment in struggling public services, incentivise investment in our infrastructure and skills, as well as provide resilience to external shocks and risks such as climate change. • A progressive taxation system, where the super-wealthy pay their fair share, and the phased implementation of carbon taxes to raise more money for public services, and to progress the transition to net zero. • A radical rethink of the social security system. Food bank use is rising and people are often unable to survive on the inadequate income benefits provide. • A major investment in childcare, both through a bespoke model in Northern Ireland and through tax relief at Westminster. 3 NORTHERN IRELAND PUBLIC FINANCES. Northern Ireland is not adequately funded to reflect relative need, and so our capacity to sustain and transform public services is hindered. To sustain and transform our education, health and justice systems, to invest in public sector pay, drive the local economy and protect our environment, we need fair funding. To achieve this, Alliance will: • Work to secure a base-lined fiscal floor, set above 124, at the next spending review. We do not believe the UK Government’s figure of 124 captures our relative need and believe this will be borne out by independent analysis that the Treasury should commission. • Continue to press for long-term transformation and public spending on an ‘invest to save’ basis. There is much more we can do with the money we have to ensure quality public services for people in NI. • Tackle the cost of division. Research from 2016 cited the costs of division in NI ranged between £400-800m. We want the UK Government to fund new research into the updated costs, so that we can tackle it and funnel savings back into public services. 4 ECONOMY.",
        "We believe Northern Ireland can become Europe's most innovative and dynamic regional economy. We have many strengths, including unique dual market access. Whilst many economic levers lie in the hands of the NI Executive, Westminster can and should do more to enable NI’s growth. We want to see: • The promotion of dual market access for Northern Ireland. The Windsor Framework provides NI with a relative opportunity compared to the rest of the UK in relation to unfettered access for goods. This opportunity should be exploited to the benefit of businesses and people in NI. • The Apprenticeship Levy reviewed, with any levy raised from Northern Ireland ring- fenced for re-investment in skills. • Renewed partnerships between Government and local businesses in NI on a North-South and East-West basis. • Support for regional industries by boosting research, innovation, skills, infrastructure and access to finance across the entire UK. • A legal duty placed on the UK Government to ensure its economic policies are assessed on their likelihood of reducing regional inequality in the economy and that levelling up is accelerated. • A fundamental review of the Levelling Up and Shared Prosperity Funds, so that they support local priorities in NI and are controlled by the NI Executive. 5 GREEN NEW DEAL. We believe tackling the climate emergency goes hand in hand with economic transformation and social justice. In 2021, we published the Alliance Green New Deal that sets out our plan for a fair, green economy. Since then, energy prices and the cost of living have reached a crisis point due to the Conservative Government's reckless inaction and u-turns on critical climate pledges. We will continue to make the case for a Green New Deal. We believe: • Energy security is more important than ever. We must invest in renewable energy to guard against price precarity and to boost the industry in Northern Ireland. • We need a UK-wide emergency retrofitting programme to reduce emissions and tackle fuel poverty. • A just transition to net zero, part funded through tax increases on fossil fuel giants and wealth, property taxes on the super- rich and via long-term green bond issuance, ISAs and pension funds. • The use of fossil fuels should end, with a ban on fracking and the opening of new coal mines and pits. 6 MIGRATION. Alliance believes in a united community.",
        "That means representing everyone in Northern Ireland, celebrating the diversity of our communities and upholding the rights and dignity of us all. We reject the current rhetoric around migrants and asylum seekers, and we support a fair and compassionate immigration system for the UK that recognises the invaluable role migrants play in our economy. We want to see: • An overhaul of the visa system to make it more affordable and the removal of cruel minimum threshold salary requirements for family visas. • The scrapping of the shortage occupation list and points-based system, replacing it with a visa system based on the real needs of Northern Ireland’s economy and society. • The creation of safe routes for asylum seekers to reduce exploitation and trafficking, and so that no one is forced to make treacherous journeys to the UK. • The Rwanda Scheme abolished, and asylum claims processed quickly in a trauma-informed way. • The right to work for asylum seekers in any job after three months so they can support themselves and their families and become active members of their communities. 7 UK POLITICAL REFORM, HUMAN RIGHTS AND EQUALITY. Just as Alliance stands for openness, honestly and fairness in Stormont, we will continue to seek to enshrine these values in Westminster. We believe human rights, equality and the rule of law are cornerstones of safety and stability, and must be defended more robustly than ever after the last Government. Alliance MPs will demand: • A fairer electoral system for the House of Commons, and a directly-elected House of Lords. • Votes at 16 for all elections and referendums. • A trans-inclusive ban on so-called Conversion Therapy that extends to NI. • Better regulation of AI and social media, including a watchdog for child safety online. 8 OUR RELATIONSHIP WITH THE EUROPEAN UNION. We believe Brexit was and continues to be fundamentally destructive for the UK as a whole. For Northern Ireland, it poses huge challenges for our economy, environment, society and wider political stability. We support the special arrangements provided for under the Windsor Framework but we want to improve its implementation to help people and businesses in NI. We want: • A negotiated Veterinary Medicines Agreement and a grace period for the next phase of goods labelling in the interim. • Improved information and assistance to businesses based in Great Britain regarding trading in NI.",
        "• Early and enhanced engagement between Northern Ireland’s elected representatives, Executive departments and other stakeholders in the development of EU law. 9 INTERNATIONAL AFFAIRS AND DEFENCE. International cooperation is essential in addressing shared global challenges. Alliance is guided by our liberal internationalist values and our commitment to the rules-based international order. The world is an uncertain place, faced with many challenges. With these principles in mind, Alliance will: • Work towards a two-state solution in the Middle East, based on international law. This includes the recognition of Palestine as a sovereign state and an end to the illegal occupation of Gaza and the persecution of Palestinians in Israel and the Occupied Palestinian Territories. • Continue in our support for Ukraine’s fight for freedom against Russian aggression and for the ongoing provision of aid to Ukraine. • Push to reinstate the Department for International Development and for spending on Official Development Assistance of 0.7% of the UK’s gross national income."
    ],
    "Conservative": [
        "CLEAR PLAN BOLD ACTION SECURE FUTURE. The Conservative and Unionist Party Manifesto 2024. We are restoring our economic stability after Covid and Ukraine. Infation is down, real wages are up, growth has returned – and we are cutting taxes to give working people financial security. This did not happen by accident. The economy is turning a corner because we built strong economic foundations before the pandemic and we have stuck to our plan. We must stick to this plan and take bold action to secure the future of our nation and society. In the next decade, we’ll face challenges to our energy and national security from foreign conficts; to our border from uncontrolled and illegal migration; to our economy from global shocks and to our society from those seeking to divide and disempower communities. Dealing with these challenges requires a clear plan and bold action. We have that plan and the courage to take the bold steps necessary to build a secure future for you and your family. A future where hard work and doing the right thing is always rewarded, not punished with higher taxes and hidden green levies, or discouraged with unconstrained welfare. A future where aspiration and opportunity are celebrated and young people always get the skills they need to succeed. A future where public services, like the NHS, serve citizens not vested interests, and every citizen upholds British values of decency, democracy and service. A future, where national, border, energy and food security are put frst, not taken for granted, and immigration is never allowed to run out of control. A future where family is always supported and communities decide their own priorities, rather than having them imposed from above.",
        "A future where we can have pride – in ourselves, in our communities and in our country. There is only one way to secure that future – and that is to vote Conservative on 4 July. We must stick with the plan – a plan that has given four million more people the security and purpose of a job, cut taxes for 29 million working people, protected pensioners with the Triple Lock, delivered more than 2.5 million homes, recruited record numbers of police officers to cut crime by more than 50%, recruited record numbers of teachers to help our children become the best readers in the West, delivered the largest sustained increase in defence spending since the end of the Cold War and got Brexit done. The alternative is we go back to square one. To a fragile economy under Labour driven by unfunded spending, higher taxes on working families and debt piling up for future generations to pay of. And where immigration, crime and defence are not taken seriously. On 4 July, choose lower immigration, lower taxes and protected pensions. Choose a secure future with the Conservatives. The Rt Hon Rishi Sunak Prime Minister and Leader of the Conservative and Unionist Party. Bold actions to deliver a secure future for our country and for your family."
    ],
    "DUP": [
        "WORKING AND WINNING FOR YOU. SPEAKING UP FOR NORTHERN IRELAND. GENERAL ELECTION MANIFESTO 2024 Making NI Work. On 4th July voters will face a clear choice at this General Election. Do they want to elect those who will go to our national Parliament and unashamedly make the case for Northern Ireland within the Union, wanting to promote it and do the best for it or will they be represented by people who won’t go or who will spend their time talking Northern Ireland down? The Democratic Unionist Party has an experienced track record of speaking up for you on issues that matter. While others talk about delivery, we can stand over what has been achieved. The DUP has the strength and depth to be able to make the Pro-Union case and to unashamedly make the case for Northern Ireland in Parliament. For Northern Ireland to truly flourish, it needs the United Kingdom to succeed and likewise for the UK to truly flourish it needs all its constituent parts and regions to succeed. This requires a strong DUP team in Westminster who will take their seats on the opposition benches and speak up for Northern Ireland, a team who will work with their DUP colleagues in the Assembly to ensure we collectively deliver for you. As we proved before, more seats means more influence which means more delivered for Northern Ireland. This manifesto and our commitments at this General Election are focused on ensuring Northern Ireland can thrive as a secure and vibrant part of the United Kingdom. We are seeking a mandate to continue Making Northern Ireland Work by: 1. Promoting the Union and Removing Barriers Within the United Kingdom; 2. Putting You First - Delivering Fair and Equitable Funding for Our NHS, and Other Public Services; 3. Campaigning to Protect Family Incomes; 4. Unleashing our Full Economic Potential; 5. A Strategic Role for UK Defence and Security; 6. Backing our Farmers and Food Security; 7. Leading a Fairer - Not Faster – Path Towards Net-Zero; 8. Defending Our Most Vulnerable; 9. Investing More in National Infrastructure, and; 10. Standing Up for Victims of Crime. By voting DUP on 4th July, you can back our positive plan and ensure our children inherit Northern Ireland in better shape than when we found it. Gavin Robinson Leader, Democratic Unionist Party. Leader’s Message. OUR COMMITMENT TO YOU...",
        "The Democratic Unionist Party has an experienced track record of speaking up for you on issues that matter. The DUP has the strength and depth to be able to make the Pro-Union case and to unashamedly make the case for Northern Ireland in Parliament. On 4th July we seek your support to elect Democratic Unionist Members of Parliament who are committed to... PROMOTING THE UNION. Working as a strong DUP team to promote and strengthen the case for the Union between Northern Ireland and the rest of the United Kingdom in Parliament. PUTTING YOU FIRST. Putting you, the people of Northern Ireland first, by working with other parties in Parliament to ensure that Northern Ireland’s case is always spotlighted, particularly focusing on the just cause of a long-term fair and equitable funding model for Northern Ireland’s needs. REMOVING BARRIERS WITHIN THE UK. Sending a strong message to a new Government that, building on the progress to date, we will continue to fight to fully restore Northern Ireland’s place within the United Kingdom, including removing the application of EU law in our country and the internal Irish Sea border which it creates. PROTECTING AGAINST ILLEGAL IMMIGRATION. Campaigning to ensure Northern Ireland is fully protected in law against illegal immigration and that Northern Ireland is part of a United Kingdom wide immigration policy that works. DELIVERING IN THE CONSTITUENCY. Delivering an unrivalled, dedicated and professional constituency advice service to constituents where the issues that matter to you will be championed and help provided when you, or those you know, need it. Promoting the Union. The Democratic Unionist Party has an experienced and unrivalled track record of making the Pro-Union case for Northern Ireland in Parliament. Through our negotiations with the Government, the DUP has secured meaningful, visible and practical proposals to deepen connections throughout our United Kingdom, whilst driving forward the Northern Ireland economy. This includes: the establishment of a new U.K East- West Council to foster deeper links for Northern Ireland as part of the Union across business, education and culture; the creation of Intertrade UK to boost, and remove barriers to, trade throughout the United Kingdom; a twinning programme for primary schools, enabling students from Northern Ireland to benefit from opportunities across the Union. Broadband.",
        "Northern Ireland is on course to be the first region in Europe to have 100 per cent fibre broadband availability because of £150 million delivered by DUP MPs. A recent Ofcom report, Connected Nations, found that 91 per cent of all premises in Northern Ireland have access to full-fibre broadband, making it by far the best-connected region within the British Isles. Pensions Triple Lock. The DUP made the retention of the triple lock on pensions a key pillar of our Confidence and Supply Agreement with the Government in 2017. In the last Parliament, we have continued to stress the importance of this guaranteed protection for pensioners across the United Kingdom. Jobs and Growth. DUP MPs have secured significant investment for driving growth, creating jobs and generating prosperity in every corner of Northern Ireland. This included: working with UK Ministers to unlock £350 million from the Government for the Belfast Region City Deal, which will create up to 20,000 new jobs, build new world- class visitor experiences and support the regeneration of our towns and cities; achieving significant progress toward a Heads of Terms agreement for the Londonderry and Strabane City Deal and the Mid South West and Causeway Coast and Glens Growth deals; £150 million in UK Government funding for creating and underpinning an Enhanced Investment Zone in Northern Ireland, to boost growth and attract investment; securing a new £10 million fund to boost investment in strategically important ports linking Northern Ireland and Great Britain. Our Record of Delivering for Northern Ireland at Westminster. Help with Energy Costs and Household Bills. DUP Parliamentarians ensured all households in Northern Ireland received the Government’s £600 energy support payment and benefited from discounted bills under the Energy Price Guarantee. They also supported the ‘Essentials Guarantee’ campaign launched by the Joseph Rowntree Foundation and Trussell Trust, which seeks to ensure that, at a minimum, Universal Credit protects people from going without essentials. Stronger Communities. The DUP team at Westminster has successfully fought for vital funding to strengthen local communities and support those who find themselves in challenging circumstances.",
        "This included: delivering a £20 million funding package for town centre regeneration in Coleraine and Londonderry; securing tens of millions of pounds in Levelling Up funding for local projects, including the redevelopment of Dundonald International Ice Bowl; fighting for, and delivering, £15 million in emergency support from the UK Government to support flood recovery schemes in Northern Ireland; successfully lobbying the Development for Levelling Up and Department for Communities to fund and launch a scheme to address Non-ACM (Aluminium Composite Material) cladded buildings in Northern Ireland, post-Grenfell. Better Infrastructure. DUP MPs secured almost £5 million through the Union Connectivity Review to progress plans for the electrification of the railway from Belfast to the Border and allowing Translink to deliver feasibility studies to: o reopen the Antrim-Lisburn railway line, with an additional stop at Belfast International Airport; o re-instate the Portadown to Armagh railway line. They also obtained a Government commitment to improving the connections between Northern Ireland and Great Britain, including through the A75 in Scotland. More for Public Services. DUP Leader Gavin Robinson was the first MP to campaign for change on how Northern Ireland is funded. It is now accepted that going forward the Treasury’s contribution to public services in Northern Ireland must be on the basis of assessed need. The DUP has led where others have followed and we will continue to seek to address the legacy of chronic underfunding across our government departments. Levelling Up. The DUP has challenged, and will continue to challenge, the Government to remedy low levels of financial support awarded to projects in Northern Ireland under the UK Shared Prosperity Fund and press for a remedy to the lack of a formal appeals process. Roll-out of the Armed Forces Covenant. Brave men and women from Northern Ireland make an invaluable contribution to the Armed Forces both at home and abroad. They and their families deserve to be treated fairly and equitably in the provision of key services. In the last term, DUP MPs: supported the Armed Forces Act 2021, delivering on our pledge to ensure the Armed Forces Covenant was legally protected in Northern Ireland as in other parts of the United Kingdom; insisted on the appointment of a Northern Ireland Veterans’ Commissioner to act as an independent point of contact for, and support, service families locally. More for Defence.",
        "DUP Leader Gavin Robinson promoted the significant contribution Spirit Aerospace, Thales, Harland and Wolff and other companies in the Aerospace, Defence, Security and Space sectors play in creating high-quality and high-paid jobs in Northern Ireland. He has campaigned to deliver significant Ministry of Defence contracts to help secure their future. The DUP also secured a Government commitment to launch a review into Northern Ireland’s role in the UK defence network. This review will: o look to increase public and commercial awareness of the Northern Ireland defence sector; o develop proposals to ensure Northern Ireland is benefiting from investment in defence industries in the same way as other parts of the UK; o explore how to leverage Northern Ireland’s cyber security clusters and academic centres of excellence; o build on established R&D programmes; o examine how a steady pipeline of highly-qualified graduates in science, technology, engineering and mathematics can generate military and security capabilities. Building on our agreement with the previous Government that the United Kingdom’s 2% NATO defence spending target should continue to be met, DUP MPs continued to pursue an upward trajectory in defence expenditure during the last term. The latest NATO figures show that the UK spent an estimated 2.3% of GDP on defence in 2023. Strengthening British Citizenship. The DUP introduced the British Nationality (Irish Citizens) Bill to ensure people born in the Republic of Ireland who have lived in Northern Ireland or other parts of the United Kingdom for at least five years can claim British citizenship without the need for tests and fees. This legislation was supported by the Government and became law in May 2024. Muckamore Abbey Public Inquiry. DUP Leader Gavin Robinson was at the forefront of bringing allegations of abuse and ill-treatment of patients at Muckamore Abbey Hospital to public attention. The DUP successfully fought for the establishment and commencement of a public inquiry and continues to advocate for increased resources to ensure this work, and the police investigations, continues. Infected Blood Scandal. The DUP in Parliament has supported calls for comprehensive compensation for the victims of the infected blood scandal. Our MPs signed an Early Day Motion in July 2023, which recognised the government’s initial actions in making interim compensation payments and called for urgent further compensation for those affected. When this issue was raised in Parliament, our MPs have ensured that Northern Ireland and its citizens were represented.",
        "Down’s Syndrome given Minority Status. DUP Parliamentarians have been a committed and consistent voice for people with disabilities. One of our MPs co-sponsored the Down Syndrome Act 2022, the world’s first piece of legislation recognising people with Down’s syndrome as a specific minority group. Justice for NI Sub-Postmasters. DUP MPs successfully fought to extend legislation exonerating sub-postmasters wrongly convicted as a result of the Horizon IT scandal to Northern Ireland. Religious Freedom. DUP MPs have been consistent advocates for freedom of religion or belief both in the United Kingdom and across the globe. They have: worked with Open Doors and other non- government organisations to throw a spotlight on the persecution of Christians internationally; supported the International Freedom of Religion or Belief Bill in Parliament; endorsed the appointment of a special envoy for freedom of religion and belief; sought additional protections to ensure government procurement takes cognisance of international human rights underpinning freedom of religion. We will build on this record to ensure that the rights of those of all faiths and none are protected across the United Kingdom. Pro-Life. DUP MPs continued to adopt an unequivocal and determined pro-life stance in Parliament, opposing the commissioning of, and funding for, abortion services in Northern Ireland. One of our MPs chaired the pro-life All-Party Parliamentary Group. Automated External Defibrillators. A DUP MP brought forward a 10-minute rule motion on Automated External Defibrillators (Public Access) Bill 2022- 23 with regards to securing public access defibrillators in schools and new public buildings. This was accepted and implemented by the government with funding attached. GCSE in Sign Language. DUP MPs supported plans to consult on the introduction of British Sign Language as a GCSE qualification in schools in England, whilst campaigning for similar steps to be considered in Northern Ireland. Baby Loss Certificates. DUP MPs worked closely with colleagues in the Assembly to seek the introduction of a Baby Loss Certificate scheme in Northern Ireland on a similar basis to England. Working together from Westminster, at Stormont and in local government, the DUP has the strength, depth and experience to deliver for communities across Northern Ireland. Since the restoration of devolution in February, DUP Ministers have been to the forefront of delivering results for households, businesses and workers. Department for Communities.",
        "Outcomes Delivered: Announced the way forward for a sign language bill, ensuring that deaf people have the same rights and opportunities as those in the hearing community; Help for working families by launching the ‘Intermediate Rent’ product, where a long-term low interest loan is offered to an operator to develop a new supply of affordable homes for rent at 20% discount off market value; Approved the Northern Ireland Football Fund – a £36 million fund of investment into performance clubs, grassroots clubs and a National Training Centre; Introduced legislation for defective premises - a bill introduced by accelerated passage to ensure homeowners in Northern Ireland enjoy the protections offered elsewhere in the UK, as highlighted by the case of Victoria Square apartments; Launched a new low interest loan scheme for the Voluntary, Community & Social Enterprise sector to develop capital projects to tackle social need, such as the funding of a new 3G pitch for Crusaders; Introduced legislation to keep Northern Ireland in line with the rest of the UK on pensions and reduce the lower age limit for auto enrolment and increasing the amount of qualifying earnings allowing more young people to start saving earlier; Introduced legislation to introduce a Pensions Dashboard – a digital service which will allow individuals to see their pensions information (including State pension) in one place online; Progress on an Anti-Poverty and Fuel Poverty Strategy, so that more people are helped into work and that we can drive down poverty in Northern Ireland; Introduced legislation for better protections to parents using Child Maintenance Services; Progress on a Disability and Work Strategy, ensuring no one who wants to work is prohibited from doing so because of their disability; Increased the upper property value limit for Co-Ownership Housing, so that more people can be supported into home ownership; Hosted the UK Sports Minister in Northern Ireland to highlight the need that exists in local sport; Allocated additional funding in 2023/24: o £1 million on library books; o £100,000 towards musical instrument grants; o £3 million supporting people programme – helping vulnerable people to live independently. Launch of consultation to reduce the threshold for charity registration to reduce bureaucracy and burdens on smaller local charities."
    ],
    "Green": [
        "Real Hope. Real Change. 2024 Manifesto for a Fairer, Greener Country, Green Party Co-leaders Carla Denyer & Adrian Ramsay. The Green Party’s Manifesto for a Fairer, Greener Country This general election is taking place during an ongoing cost of living crisis, in an increasingly volatile world. No wonder so many of us feel anxious and are losing hope in the future. We live in one of the richest countries on the planet, and yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and a hospital appointment or a dentist is like gold dust. Our promise to you is that all this can change. We can create a greener, fairer country together – one in which we are all safer, happier and more fulfilled. It will take MPs prepared to make brave, principled choices on your behalf. And it will take the kinds of policies set out in this manifesto, and for which elected Green MPs will fight hard every single day for you. The election is also taking place against the background of a climate emergency. Since the last election, there have been an increasing number of days and months in which global temperature increases have breached 1.5 o C, an increase that would make human life on earth unliveable. Despite commitments from the United Nations, national and local governments, corporations and individuals, greenhouse gas emissions are still rising. And our understanding of what this means is increasing too: we know that the social and economic impacts of climate breakdown are already being felt and will continue to be far worse than previously imagined. As a political party, we believe in offering hope. And we believe in following the science and speaking the truth, too.",
        "This manifesto sets out what we think is achievable given the failure of successive governments to prepare with anything like the urgency and ambition that climate scientists have been telling us is needed for decades. The current UK commitment to net zero by 2050 fails to reflect that we can – and must – do so much more. That we can and must make the right political choices in order to transition at speed to a decarbonised economy. One that’s no longer in hock to the fossil fuel giants, but instead runs on clean, green and cheap renewables. An economy in which it’s cheaper to heat our homes, to get out and about and to run a business. And this manifesto sets out too how fairness can and must run through every part of the change that’s coming – from training the new workforce that will be needed to transform our economy, to investing in our vital public services, to lifting all of us up through a compassionate welfare system. The solutions to the climate crisis are the same as those needed to end the cost of living and inequality crises, making the future not just more liveable but fairer for us all too. Throughout this manifesto, you’ll find examples of how climate action means better public services, warmer homes, stronger communities and a restored natural world. Voting Green on 4th July is your way of showing you believe in our shared future. We believe the ambitious plans we are outlining here are not just possible but essential. A Green vote is the only vote that counts if you want a secure and happy future on a safe planet. A Green vote means choosing real change and real hope."
    ],
    "Labour": [
        "Change Labour Party Manifesto 2024. My plan for change. This election is about change. A chance to stop the endless Conservative chaos that has directly harmed the finances of every family in Britain. A moment where we can turn the page on a set of ideas that, over 14 years, have consistently left us more vulnerable in an increasingly volatile world. And an opportunity to begin the work of national renewal. A rebuilding of our country, so that it once again serves the interests of working people. Restore hope. Every great nation is held together by shared beliefs. To outsiders they may not seem exceptional or distinctive, but they are essential for a sense of collective national purpose. Britain is no different, but at this moment two of our most important beliefs are in grave danger. First, that politics should be driven by a sense of service to the country, not considerations of party or self-interest. Second, that if you work hard then - whoever you are, wherever you started in life - Britain is a country that will respect your contribution and give you a fair chance to get on. When I consider these beliefs, it is hard not to think back to my childhood. Then, as now, Britain’s place in the world was uncertain. Then, as now, our economy was gripped by stuttering growth and a cost-of-living crisis that hurt working people. Yet back then, there was at least a degree of security in being able to take those two fundamental beliefs for granted. For families like mine, this was a comfort. The knowledge that Britain would offer your children a better future gave us hope. A hope that may not sound high- minded or particularly idealistic, but which families like mine could build a life around. Stop the chaos. To restore this hope, we must first end the Conservative chaos. The visible decline in our communities –people waiting on trolleys in A&E; families weighed down by soaring mortgages; sewage in our rivers – is not an accident. Rather, it is a direct result of a governing party that, time and again, puts its own interests and obsessions above the issues that affect families. The result is a vicious cycle – decline feeding off chaos, chaos feeding off decline – that will continue if they return for five more years.",
        "Only a Labour government can break this cycle and stop the chaos. Turn the page. We must turn the page decisively on the Conservative ideas that have caused the chaos. The world has become increasingly volatile, with a major war in Europe for the first time in a generation and ever greater threats to the living standards of working people. This ‘age of insecurity’ requires the government to step up, not stand aside. This means a return to the foundations of good government: national security, secure borders, and economic stability. But it also requires an enduring partnership with business to deliver the economic growth we need. It needs more focus on long-term strategy, not the short-term distractions that can animate Westminster. And it demands a final and total rejection of the toxic idea that economic growth is gifted from the few to the many. Because whether it is crashing the pound to give tax cuts to the richest 1%; degrading public services because of a mess made by the banks; or the failure to invest in clean British energy that left us exposed when Putin invaded Ukraine – so much of what Britain has been through in the past 14 years is explained by a Conservative failure to face the future. Only Labour can turn the page. Rebuild our country. We must rebuild our country. It will not be easy. Not only because there is no quick fix to the mess the Conservatives have made. But also, because their failures have sapped our collective confidence that Britain can still achieve great things. I reject this with every fibre of my being. Despite all the chaos inflicted on Britain, the country I see is one where working people never let each other down. They came together in the pandemic – missed weddings, funerals and last goodbyes – to save the lives of people they will never meet. They dug deep in the years of austerity, to keep delivering the public services people needed. And throughout the cost-of-living crisis, they found a way to support those less fortunate than themselves. We are still a great nation. We can still achieve great things. What we lack is a government that can match the ambition working people have for their family and community, with a credible long-term plan. This manifesto is that plan.",
        "Fully costed, fully funded – built on a rock of fiscal responsibility. At its heart are five national missions – with clear first steps to begin the journey of rebuilding – that provide a clear destination for everyone invested in Britain’s future. A new Britain, where wealth is created in every community. Where the golden opportunity of clean British power is harnessed for lower bills. Where your town centre has been revitalised and everyone feels safe to walk the streets. Where you can go to work and know you will be treated with dignity and respect. Where our children are equipped with the skills to thrive in the future. Where our NHS is once again at the cutting edge of healthcare. And where we show that politics can be about serving the country. It’s time for change. I know some people will roll their eyes at this last sentence. Yet serving our country is the only reason I came into politics. The defining purpose of my Labour leadership has been to drag my party away from the dead end of gesture politics and return it once more to the service of working people. I have changed my party. Now I want the chance to bring that change to the country. But to succeed we need everyone, every community, to play their part. I know, after everything you have been through in the past 14 years, that this is a hard request to make. But I also expect, deep down, that you know this is what our country needs now – an end to the chaos, a turning of the page, and a patient but determined rebuilding of our country. So, I invite you to join us in this common endeavour of national renewal. It is time to change Britain. My first steps for change. 1. Deliver economic stability with tough spending rules, so we can grow our economy and keep taxes, inflation and mortgages as low as possible. 2. Cut NHS waiting times with 40,000 more appointments each week, during evenings and weekends, paid for by cracking down on tax avoidance and non-dom loopholes. 3. Launch a new Border Security Command with hundreds of new specialist investigators and use counter-terror powers to smash the criminal boat gangs 4.",
        "Set up Great British Energy, a publicly-owned clean power company, to cut bills for good and boost energy security, paid for by a windfall tax on oil and gas giants. 5. Crack down on antisocial behaviour, with more neighbourhood police paid for by ending wasteful contracts, tough new penalties for offenders, and a new network of youth hubs. 6. Recruit 6,500 new teachers in key subjects to prepar children for life, work and the future, paid for by ending tax breaks for private schools. Mission-driven government Ending the Conservative chaos is vital, but turning the page with a new government is not in itself enough to tackle the deep-rooted challenges our country now faces. To rebuild Britain, we need to change how Britain is governed. For too long, Britain has been held back by governments that, because they lack a relentless focus on long-term ends, are buffeted about by events. Politics has enormous potential to change lives for the better, but too often different parts of the government have pursued their own narrow goals rather than working together. Government is at its best when working in partnership with business, trade unions, civil society, faith groups, and communities. But without a shared project those partnerships barely get off the ground. So, as well as a new administration with new priorities, Britain needs a new approach: mission-driven government. Mission-driven government means raising our sights as a nation and focusing on ambitious, measurable, long-term objectives that provide a driving sense of purpose for the country. It means a new way of doing government that is more joined up, pushes power out to communities and harnesses new technology, all with one aim in mind – to put the country back in the service of working people. Labour’s five missions to rebuild Britain are: Kickstart economic growth to secure the highest sustained growth in the G7 – with good jobs and productivity growth in every part of the country making everyone, not just a few, better off. Make Britain a clean energy superpower to cut bills, create jobs and deliver security with cheaper, zero- carbon electricity by 2030, accelerating to net zero. Take back our streets by halving serious violent crime and raising confidence in the police and criminal justice system to its highest levels.",
        "Break down barriers to opportunity by reforming our childcare and education systems, to make sure there is no class ceiling on the ambitions of young people in Britain. Build an NHS fit for the future that is there when people need it; with fewer lives lost to the biggest killers; in a fairer Britain, where everyone lives well for longer. Delivering the change Britain needs will require perseverance. The starting point for delivering these missions is to ensure the foundations of good government are right. Labour will make sure we have strong national security, secure borders, and economic stability. Building on these secure foundations, we have already set out the first steps for change. Today we present further policies in this manifesto, as part of the journey of rebuilding our country."
    ],
    "LibDem": [
        "Foreword. This election is our chance to win the change our country desperately needs. Everywhere I go across our great United Kingdom, I see people from all backgrounds and all walks of life, working hard, raising families, helping others and playing by the rules. But they have been let down and taken for granted for far too long by this out-of-touch Conservative Government. Families and pensioners are struggling with sky-high energy bills, food prices and housing costs – and the Conservatives have only added to the pain, because they just don’t care. The Conservatives have plunged the NHS into crisis, failing to deliver the new hospitals they promised and making people wait hours for an ambulance, weeks to see a GP or months for urgent cancer treatment. They are letting water companies get away with pumping filthy sewage into our rivers and lakes and onto our beaches. It’s time for a change. These Conservatives have got to go. And in so many parts of the country, we have shown that it is the Liberal Democrats who can get them out. But this election is about more than a change of government. We must transform the very nature of British politics itself, so that we can fix the health and care crisis, get our economy back on track, end the appalling sewage scandal, and give people the fair deal they deserve. Every vote for the Liberal Democrats is a vote to elect a strong local champion who will fight for a fair deal for you and your community. A fair deal where everyone can afford a decent home somewhere safe and clean – with a comfortable retirement when the time comes. A fair deal where every child can go to a good school and have real opportunities to fulfil their potential. A fair deal where everyone can get the high-quality healthcare they need, when they need it and where they need it. That is the fair deal the Liberal Democrats are fighting for. I know we can achieve it. So join us, and let’s make it happen! Ed Davey. Our Fair Deal. In so many ways, things in our country are broken. The economy, the National Health Service, the climate, the housing market – all are in crisis after years of Conservative neglect. Schools are crumbling and clean rivers seem a thing of the past.",
        "The Conservatives have wrecked our relationship with our nearest neighbours in Europe, and our political system is simply not fit for purpose. Millions of people feel powerless and excluded. It doesn’t have to be this way. Britain has overcome big challenges before and we can do it again now. For more than 150 years, Liberals and Liberal Democrats have led the fight for a fair, free and open society: championing free trade, introducing the state pension and free school meals, laying the foundations of the welfare state and the NHS, legalising same-sex marriage, and taking urgent action to tackle the climate emergency. Today, our fair deal would give everyone the power to make the most of their potential, and real freedom to decide how they live their lives. It would call the over-powerful to account. It has five key themes. 1. A fair deal on the economy. Everyone deserves the chance to get on in life, see their hard work properly rewarded and realise their hopes for the future. Businesses and entrepreneurs should be supported to create worthwhile jobs in every part of the UK. Liberal Democrats will invest in renewable power and home insulation to drive a strong economic recovery, bring down energy bills and create clean, secure, well-paid new jobs. We will put people first, investing in more apprenticeships and new Lifelong Skills Grants. We will overhaul parental leave to give families more choice and flexibility over how to juggle work and home life. We will support entrepreneurs, back small businesses, and reform business rates to help our high streets. We will make Britain a world leader in the new infrastructure, businesses and technologies needed to tackle climate change. We will manage the public finances with the utmost care and responsibility. We will fix the UK’s broken relationship with Europe and tear down the Conservatives’ damaging barriers to trade. 2. A fair deal on public services. Everyone should receive the care they need when they are ill or frail, and a helping hand when they fall on tough times. A strong NHS – open to all, regardless of wealth – gives people the freedom they need to live their lives as they choose. Every child deserves the best possible start in life. We know that education is the best possible investment in our country’s future.",
        "Liberal Democrats will give everyone a new right to see a GP within seven days, or 24 hours if it’s urgent, with the extra doctors needed to make it happen. We will invest in improving public health, expanding early access to health services, and fixing social care. We will give every child the support they need with more specialist teachers, free school meals for all children in poverty, and a dedicated mental health professional in every school. We will repair the broken safety net that currently consigns so many to poverty. We will restore community policing and ensure that every burglary is properly investigated. And we will fund public services through fair taxes, such as reversing the Conservatives’ tax cuts for big banks. 3. A fair deal on the environment. Everyone should be able to enjoy the benefits of our wonderful natural environment, and our children should inherit the future they deserve. We must act now – locally, nationally and globally. The UK can lead the world with innovation and ingenuity, while boosting the economy and enhancing everyone’s quality of life. Liberal Democrats will hold big companies to account by giving them a duty to protect the environment, including banning water companies from dumping raw sewage into rivers, lakes and coastal areas. We will put tackling climate change at the heart of a new industrial strategy. We will cut emissions and bills with an emergency Home Energy Upgrade programme. We will drive a rooftop solar revolution and invest in clean energy, transport and industry. We will restore nature and tackle toxic air pollution. And we will provide skills training, incentives and advice to help families and businesses with the transition to net zero. 4. A strong United Kingdom and a fair international order. Liberal Democrats are proud internationalists. We believe that our country and our people thrive when we are open and outward-looking. The UK can be an incredible force for good when it stands tall on the world stage, and both the Covid pandemic and Vladimir Putin’s illegal war in Ukraine show that events beyond Britain’s borders inevitably become our concern. Liberal Democrats will immediately fix our broken relationship with Europe, forge a new partnership built on cooperation, not confrontation, and move to conclude a new comprehensive agreement that removes as many barriers to trade as possible.",
        "We will stand up to authoritarianism by championing the liberal, rules-based international order. We will reverse the Conservatives’ damaging cuts to the Army and international development. We will work across borders to provide safe and legal routes to sanctuary for refugees and tackle common threats such as human trafficking, cybercrime and terrorism. 5. A truly fair democracy. Every person matters. Liberal Democrats believe that basic rights and dignity are the birthright of every individual, to be respected, cherished and enhanced. Everyone should have equal power in our democracy, and be able to hold all Members of Parliament properly to account. Liberal Democrats will introduce proportional representation for electing MPs, and local councillors in England, and cap donations to political parties. We will shift power out of the centre in Westminster and Whitehall, so local decisions are made by and for the people and communities they affect. We will demand higher standards of behaviour from Government Ministers by enshrining the Ministerial Code in law. We will champion the UK’s Human Rights Act and resist any attempts to weaken or repeal it. Our goal is to transform the nature of British politics itself – to make it relevant, engaging and responsive to people’s needs and dreams."
    ],
    "PlaidCymru": [
        "FOR FAIRNESS, FOR AMBITION, FOR WALES. Plaid Cymru Manifesto for the Westminster General Election 2024. Introduction. By Rhun ap Iorwerth MS Plaid Cymru MPs have always been Wales’s voice in Westminster, not Westminster’s voice in Wales. This is not as good as it gets for our nation. The following pages set out our party’s vision of a fairer, more ambitious future where everyone can achieve their potential, regardless of circumstance or background. Being tied to Westminster means all risk and no reward for our nation. Wales is languishing at the bottom of too many league tables, our economy is stagnating, our transport network is creaking, and the lack of control over our natural resources means that we are energy-rich but fuel-poor. What sets Plaid Cymru apart is a record of not taking Wales for granted and always putting the interests of our communities and nation first. After 14 years of Tory cuts and weak opposition from Labour, Plaid Cymru offers a real alternative for Wales. We will fight every day for the billions owed to Wales from the HS2 high-speed rail project, and for a fair funding model which funds our country according to need, not population. This will enable us to invest in our public services and better reward our workforce. By supporting families and by devolving powers to ensure that more of the decisions that affect Wales are made in Wales, we will address the cost of living crisis and provide Welsh solutions to Welsh problems. Our ambition can be seen in our confidence that Wales can and should run its own affairs as an outward looking independent nation. Plaid Cymru is a party for the whole of Wales. Our candidates are rooted in their communities and passionate about overcoming the challenges facing our economy and public services.",
        "Wherever you live, you can be sure that a vote for Plaid Cymru on 4th July is a vote for a Member of Parliament who will always stand up for Wales’s best interests every day. Secure the £4bn owed to Wales from HS2 to invest in improving our own public transport in all parts of the country and reversing cuts to local bus services. Demand a fair funding system for Wales, based around our needs, giving us the public services we deserve. Fair funding from Westminster, enabling us to invest in our NHS workforce and recruit 500 GPs into Wales after years of Tory cuts and Labour mismanagement in Cardiff. A new Cancer Strategy to ensure cancers are caught and treated earlier, and ending Wales’s postcode lottery for treatment. Help 330,000 Welsh families to deal with the cost of living crisis by increasing Child Benefit by £20 per week. This will take 60,000 children out of poverty in Wales. Redressing economic unfairness; increasing windfall taxes and devolving the Crown Estate in order to create green jobs and build prosperity. FAIR FUNDING FOR WALES. FAIR PLAY FOR PATIENTS. FAIRNESS FOR FAMILIES AND COMMUNITIES. “Plaid Cymru is a party for the whole of Wales. Our candidates are rooted in their communities and passionate about overcoming the challenges facing our economy and public services.” “ Wherever you live, you can be sure that a vote for Plaid Cymru on 4th July is a vote for a Member of Parliament who will always stand up for Wales’s best interests every day.” The past fourteen years of Conservative UK Government have been economically very damaging for people, families and business in Wales."
    ],
    "Reform": [
        "Our Contract with You. Britain Needs Reform and Reform UK Needs You. Britain has so much potential. Our country is full of talent and energy. Brexit is the opportunity of a lifetime. The challenges we face are vast. Both Labour and Tory governments have broken promise after promise. They have destroyed trust in our democracy and betrayed the British people. Our country is worse off, both financially and culturally. The economy is being wrecked by record high taxes, record high national debt, wasteful government spending and nanny state regulations. Record mass immigration has damaged our country. The small boats crisis threatens our security. Multiculturalism has imported separate communities that reject our way of life. Divisive, ‘woke’ ideology has captured our public institutions. Transgender indoctrination is causing irreversible harm to children. The unprecedented population explosion has pushed Britain to breaking point. There’s a housing crisis. A benefits crisis. Record crime. Record NHS waiting lists. Wages are stagnating. Net Zero has sent energy costs soaring. It is making us poorer and colder, damaging British industry and forcing drivers off the road. The Tories have broken Britain. Labour will bankrupt Britain. A vote for either is a vote for more incompetence, dishonesty and defeat. The two-party system has failed. We are ruled by an out-of-touch political class who have turned their backs on our country. But there is an alternative. The British people now have a common sense choice in Reform UK. Our Contract with You is a serious plan to reshape the way our country is run. The government must work for the British people. Not against them. Only Reform UK will stand up for British culture, identity and values. We will freeze immigration and stop the boats. Restore law and order. Repair our broken public services. Cut taxes to make work pay. End government waste and deliver our fully funded plan for zero NHS waiting lists. We will unlock Britain’s vast energy treasure of oil and gas to slash energy bills, beat the cost-of-living crisis and unleash real economic growth. Once and for all, we will take back control over our borders, our money and our laws. Only Reform UK will secure Britain’s future as a free, proud and independent sovereign nation. Nigel Farage Leader, Reform UK. Our Contract with You is not just another party manifesto.",
        "It sets out the reforms that Britain needs in the first 100 days following a general election and thereafter. It has been produced with advice from a range of independent economists, think tanks and advisors on costs and savings. Costings can be found at the end of each policy page. Some policy areas come with net costs and others with net savings. We have also included extra growth assumptions from our economic reforms. Final annualised budget calculations across a 5 year term of government can be found at the end of this Contract. We are impatient for change. We are doers and achievers. Our Contract with You will be delivered by people with a real track record of success. OUR CORE PLEDGES TO YOU. Fourteen years of Tory failure are coming to an end. A Labour government would ramp up mass immigration, crime, and taxes even further. Labour and the Tories are two sides of the same coin. Only Reform UK is ready to stand up for common sense politics. We set out our plan in this document, Our Contract with You. Wherever you look, Britain needs Reform. Our Contract with You covers the most important areas of policy for you and your family, but we have summarised these into five core pledges: 1. Imagine Smart Immigration, Not Mass Immigration All non-essential immigration frozen to boost wages, protect public services, end the housing crisis and cut crime. 2. Imagine No More Small Boats in the Channel Illegal migrants who come to the UK will be detained and deported. And if needed, migrants in small boats will be picked up and taken back to France. 3. Imagine No NHS Waiting Lists Still free at the point of delivery, healthcare needs reform to improve outcomes and enjoy zero NHS waiting lists. Cut back office waste to spend more money on the frontline. Tax breaks for doctors and nurses to tackle the staffing crisis. 4. Imagine Good Wages for a Hard Day’s Work Lift the income tax starting threshold to £20k to save the lowest paid £1,500 per year. This takes 7 million of the least well-off out of Income Tax to make work pay and get people off benefits. 5. Imagine Affordable, Stable Energy Bills Scrap energy levies and Net Zero to slash energy bills and save each household £500 per year.",
        "Unlock Britain’s vast oil and gas reserves to beat the cost of living crisis and unleash real economic growth. This is whatThis is what Reform UK MPs willReform UK MPs will fight hard for if elected.fight hard for if elected. So if you want change, vote for it on July 4th. Vote Reform UK to get reform. Reform UK will secure Britain’s borders to protect wages, our public services, and British culture and values."
    ],
    "SDLP": [
        "SDLP MANIFESTO WESTMINSTER 2024. An Election for Change. Leader’s Message. This election is about change. It is the clearest opportunity we have had in more than a decade to put an end to the politics of austerity, isolation and division that have driven governments for 14 brutal years. It is a chance for Northern Ireland not just to send a message against failed policies of austerity and ever-hardening Tory nationalism, but to send MPs that will use their voice and their influence to fight for all the people of this region. A Change Election. For months now, SDLP representatives have been speaking to people from every background and in every community across the North. We have heard first-hand accounts from people who’ve been forced to take out credit union loans to pay for private healthcare, from nurses and junior doctors, running themselves into the ground to make sure that the people in their care get the best possible outcomes, to young people who can’t afford to buy their first home, pensioners struggling to keep the heat on (even in June) and others lucky enough to get on the property ladder who are at their wit’s end because they can’t keep up with sky high mortgage prices. How could you not be frustrated with the way things are? After 14 years of brutal Tory governments, public services are on life support, our health service has already started to collapse, wages have stagnated and costs are through the roof. And in the middle of it all, the two local parties charged with leading devolved Government at Stormont both decided to tear it down for years at a time, leaving us unprotected from unfiltered Tory austerity. It doesn’t have to be like this. Using our voice. Almost five years ago people from every community came together to cast their votes for change. After two years where the only voices from here at Westminster were the DUP, who used that power to cause chaos, voters came out in huge numbers and decided to use their voice. In an election where we were all told that we couldn’t make a difference, people decided to choose change. They sent more than just a message - they sent hardworking SDLP MPs who have fought for them, their family and our communities every single day. And we have delivered.",
        "We’ve secured almost £100m for university expansion in the North West. We delivered a step change in investment from the Irish Government through the Shared Island Unit worth more than £1bn for projects like Narrow Water Bridge, the A5, Casement Park and far more. We’ve brought new regeneration funds to redevelop and enhance town and city centres and we’ve seen investment in addiction services to help the most vulnerable people and families who need our help. We’ve done all that, and more, with a Tory government - imagine what we could do with a Labour government that understands this place and listens to the views of our MPs. SDLP MPs are best placed to deliver change because we will have the strongest relationship with a new government. Other parties have done deals with the Tories in their own self-interest or won’t bother turning up to make a difference. By contrast, SDLP MPs will be there where it counts and when it counts to deliver for everyone in our communities. Raise your voice. SDLP MPs have made sure that our voice - and your voice - is heard. On the issues that matter to people - standing up for our health service, demanding oil and gas companies pay higher taxes on their profits to support people struggling with the cost of living, fighting for investment in public services, jobs and skills - we have been loud and clear. And on burning international issues - we have been the most vocal champions for peace. Claire Hanna and I have been the strongest opponents of the blank cheque written by the British Prime Minister and the American President for the onslaught against the Palestinian people. We have spoken hard truths to our political rivals and our allies when they’ve got this wrong. And while others enjoyed parties in the White House, we stood in solidarity with people here who have always supported peace and an end to the genocide. In Stormont, people are already seeing the impact that our constructive SDLP Opposition voice is having: holding the Executive to account on moving beyond rhetoric towards delivery of a plan to rescue public services. That’s what you get with SDLP MPs - representatives who stand their ground, stick to their principles and fight for you, whatever the political weather. A chance for change.",
        "After more than a decade of austerity, isolation, division and deadlock we have a chance for change. It is a chance for a new start for all of us. On 4th July, take that chance. Vote SDLP. Our Priorities for Change: A New Start - Remove this Tory Government from power. Better Public Services for All – reduce hospital waiting lists with additional investment in health. Improved Funding Model for NI. Repeal the Legacy Act. A Fairer Economy for All. Recognise the State of Palestine and end arms exports to Israel. Restore nature and support a just transition."
    ],
    "SinnFein": [
        "Strong Leadership Positive Change. CEANNAIREACHT LÁIDIR, ATHRÚ DEARFACH. Every day, Sinn Féin representatives are providing strong leadership and delivering positive change for communities across Ireland. Nobody works harder for the communities and people we represent. Sinn Féin is on the side of workers and families, working nationally and delivering locally. We are leading the way to build a stronger, better and fairer country. Tá muid ag obair le hÉireann a aontú. The election on July 4th is a real opportunity to step forward towards a better future. For a society that defends you when you are at your weakest, that encourages you when you are at your strongest. Sinn Féin is committed to delivering on the things that matter most to workers and families: healthcare, the cost of living, housing, education, childcare. We are focused on what is possible to achieve if we work together, making politics work, and demonstrating that positive change is possible. On day one after the Westminster election, Sinn Féin MPs will be working hard as part of a strong all-Ireland Sinn Féin team to deliver for all our people and communities. So I am asking you to send a clear message in this election about what you want for the future. To vote for strong leadership and positive change. To vote for a party that is committed to working for all. On July 4th Vótáil Sinn Féin X. Mary Lou McDonald TD SINN FÉIN PRESIDENT. A message from Uachtarán Shinn Féin Mary Lou McDonald TD. INTRODUCTION. Leas-Uachtarán Shinn Féin First Minister Michelle O’Neill MLA In this election people can send a clear message about what they want for the future. By voting for Sinn Féin people are endorsing strong leadership, positive change, and a commitment to work for all.",
        "You have an opportunity to vote for decisions about your life and your future to be made here, at home. You are supporting better funding for our public services and rejecting years of Tory cuts which have impacted the people of the North. And you are supporting a stronger economy, creating more well-paid jobs, and making childcare more accessible and affordable. No matter what background or community people come from, Sinn Féin MPs will work hard and deliver on the things that matter to workers, families and businesses – the cost of living, health, education, good jobs and investing in local and rural communities. Change will only be delivered in the North by all of us working together in the Executive and Assembly, but this election gives people a chance to send a clear message about the future they want. Let’s seize the opportunity to return the strongest Sinn Féin team and keep moving forward to a new and better future. On July 4th vótáil Sinn Féin X. Michelle O’Neill MLA SINN FÉIN VICE PRESIDENT FIRST MINISTER."
    ],
    "SNP": [
        "“A FUTURE MADE IN SCOTLAND.”. VOTE SNP FOR SCOTLAND. DECISIONS MADE IN SCOTLAND, FOR SCOTLAND. VOTE SNP FOR SCOTLAND TO BECOME AN INDEPENDENT COUNTRY. “We will put the interests of the people of Scotland first, and protect public services like our cherished NHS”. OUR VISION. DECISIONS MADE IN SCOTLAND, FOR SCOTLAND. I believe people are crying out for principled leadership, which is prepared to argue for what it believes in. In this election, and in this manifesto, that is what the SNP is offering. Moderate left of centre policies to make life better for the people of Scotland. SNP MPs who will always put the interests of the people of Scotland first, and protect public services like our cherished NHS. And, at the core of what we offer, the belief that decisions about Scotland should be made in Scotland through independence. The Westminster system is broken, and for far too many people, the UK economy has failed. So at this election the SNP is putting forward a positive, optimistic and hopeful alternative to that broken system and that failed economy. The Tories have enforced deep spending cuts, they’ve imposed Brexit and have worsened the cost of living crisis. They need to go. But we have to take care about what replaces them – the answer is not more spending cuts. It is not more Brexit and it is definitely not more Westminster decision-making about Scotland. And yet that is what the Labour Party is committed to: cuts, Brexit and continued Westminster control. I honestly don’t believe that’s something Scotland can bear. Voting SNP is the best means of ensuring Labour are stopped from carrying out their cuts. SNP MPs will do all that they can to protect Scotland’s NHS and act to stop further austerity being imposed by Westminster. But, however hard we work, the Westminster conspiracy of silence between Labour and the Conservatives on the cuts to come and on the damage of Brexit, demonstrates that decisions about Scotland’s future should be taken in Scotland. In Government at Holyrood with limited powers and in line with our principles, we’re helping with the cost of living through free prescriptions, all day off peak rail fares and free bus travel for young people.",
        "We’ve grown the economy faster, per head, than the UK, we have the best performing core A&E units in the UK, and we’ve built 40% more affordable homes per head than in England, and over 70% more than in Wales. With independence, all the key decisions over our economy, taxes, and spending will transfer from Westminster to Scotland. I have no doubt that everyone who lives in our wonderful, diverse country – whether they were born here, or have come from the rest of the UK or further afield – are the best people to make decisions about Scotland’s future. So on Thursday, 4th July, to remove the Tories from office, to put the interests of Scotland first, and for a future made in Scotland, vote SNP. John Swinney MSP, Leader, Scottish National Party. Deliver independence to strengthen our economy, tackle the cost of living, and bring about a fairer country. End 14 years of austerity, reversing deep damaging cuts to public services that have put real pressure on the money available for the NHS and schools. We will stand against the Westminster consensus on cuts. Rejoin the EU, reverse the damage of Brexit and re-enter the single market restoring free movement for EU citizens. Tackle the cost of living crisis by providing urgent support for household finances and reducing the impact of rising interest rates and inflation. Protect our NHS from the twin threats of Westminster privatisation and austerity. The UK Government should back our Bill to keep the NHS in public hands and boost NHS England funding by at least £16bn each year, providing an extra £1.6bn to NHS Scotland. Reverse the £1.3bn Westminster cut to our capital budget, to enable us to invest in new hospitals, schools, rail and road infrastructure and help to achieve net zero. “We will protect our NHS from the twin threats of Westminster privatisation and austerity.” OUR KEY PLEDGES. Demand an immediate ceasefire in Gaza, release of hostages and ending arms sales to Israel. We call on the UK Government to immediately recognise Palestine as an independent state. Scrap the two child benefit cap, ending the unnecessary suffering caused by both the benefit cap on children and associated rape clause.",
        "Demand the devolution of new borrowing powers to invest in a just transition and that the new UK Government match our £500m Just Transition Fund for the North East and Moray to help build on the region’s world-renowned expertise, create jobs, foster innovation and deliver a fair and managed transition to net zero. Legislate for an essentials guarantee ensuring that everyone can afford basic necessities like food and utilities. Support the abolition of the undemocratic House of Lords. Stand up for WASPI women by making sure the UK Government delivers full, fast and fair compensation for women who have been wronged by pension inequality. Devolve powers to create a bespoke migration system for Scotland that values those who decide to work, live, study and invest here and allows us to address our specific demographic and economic needs. Empower workers by scrapping exploitative zero hours contracts, banning callous ‘fire and rehire’ practices and repealing the Minimum Service Bill. Scrap the Rwanda scheme and stand firm against the demonisation of migrants. Tackle the drugs death crisis by taking a radical public health approach; decriminalising drugs for personal use and introducing a framework to allow Supervised Drug Consumption Facilities. Protect pensions by maintaining the triple lock and move to deliver a wellbeing pension. We will oppose any further increases in the state pension age. Scrap Trident and invest the money into conventional defence and public services. Increase maternity pay by bringing the UK into line with other European countries and promoting shared parental leave. Defend free university tuition in Scotland. The SNP is the only party that will protect students and defend free education, meaning graduates in Scotland are thousands of pounds better off. “In an independent Scotland, decisions about Scotland will be made in Scotland, for Scotland.”"
    ],
    "TUV": [
        "RESTORE THE UNION. THE REALITY: Our union with GB has been splintered by the Protocol. OUR MISSION: The reunification of the UK. FOREWORD. As we elect a new Parliament there is no escaping the constitutional affront that Westminster is no longer sovereign over this part of the Kingdom, because of the appalling surrender of powers to a foreign parliament. To anyone who cares about the Union, this is the core issue. TUV has told you the truth about the iniquitous Protocol from the beginning. While others have faltered and preferred the baubles of office, TUV has spoken with strength, not weakness. It is such strength that unionism needs like never before. So, across the Province, I urge you to vote TUV - No Sea Border. William Ross TUV President. PERSONAL MESSAGE FROM JIM ALLISTER. This election is overshadowed by the greatest constitutional crisis Northern Ireland has ever faced. Our nation is partitioned by a border in the Irish Sea and unaccountable rule from Brussels dictates many aspects of our lives. Remarkably, while the rest of the UK is electing MPs to make the laws which govern them, we in Northern Ireland have no say in over 300 areas of law. Those are decided by the EU, where we have no input. Sadly, the unity once enjoyed across Unionism has been shattered by those who broke their word to you and obtained votes dishonestly in the council elections and indeed Assembly elections when they told you they were opposed to the Sea Border. At the beginning of the year, the DUP claimed that the Sea Border was gone. “Zero checks, zero paperwork” was the infamous boast of Jeffery Donaldson with Gavin Robinson standing beside him in support. Now, faced with an election, the tune has changed.",
        "Those who admit they lied to you in February do not deserve your vote in July. Truth, honesty and integrity still matter in politics. You can make that clear on 4th July by voting TUV - No Sea Border. Jim Allister KC MLA TUV Leader. IMPACTING ON NATIONAL POLITICS. In this election, TUV - No Sea Border is offering the people of Northern Ireland the opportunity to vote for truly national politics. We are campaigning with a common platform with Reform UK meaning the parties have agreed the following: Reform UK and TUV Memorandum of Understanding It is hereby agreed that for the purpose of the upcoming General Election Reform UK and TUV shall cooperate in providing and mutually supporting candidates in Northern Ireland on the basis of the following common platform: • upholding and strengthening the Union between Great Britain and Northern Ireland, including the full restoration of Art 6 of the Act(s) of Union; • equal rights for all citizens within the United Kingdom; • rejection of the Irish Sea border and the subjection of Northern Ireland to EU law and the ECJ; • the completion of a full Brexit so that the United Kingdom in all its parts enjoys full independence and economic freedom; • robust immigration system and controls; • a taxation system, both personal and commercial, which rewards effort. In all other matters the two parties may develop and advance their own policies in accordance with their ideological outlook. Any MPs elected will operate in pursuit of this agreement under a common Whip. Moreover, going forward, Reform UK and TUV will collaborate in joint political ventures with a view to advancing our shared vision of strengthening the links and political integration of all parts of the United Kingdom.",
        "An inclusive rather than disparate United Kingdom is our goal. Dated 16th March 2024. This agreement has put the Sea Border, which many seek to suggest is a settled matter, right at the heart of this election campaign. It commits what is now the second largest party in polling UK wide to restore Northern Ireland’s place as a full and equal part of the nation, the removal of the Sea Border and the completion of a Brexit from which the whole of the UK benefits. For far too long Unionism has been parochial and detached from the politics of the entire nation. The historic link up between TUV and Reform UK changes that."
    ],
    "UUP": [
        "MAKING NORTHERN IRELAND WORK. VOTE FOR CHANGE. VOTE ULSTER UNIONIST. A Message From Doug Beattie MC Ulster Unionist Party Leader. Elections are about people and none are more important than a General Election. On the 4th July ordinary people will make an extraordinary decision as they decide who they believe is best placed to represent them over the next 5 years. As the leader of the Ulster Unionist Party, I am acutely aware that we have not had a presence on the green bench of Westminster for a number of years. Northern Ireland’s representation has been poorer for not having Ulster Unionist MPs making the case for Northern Ireland and our place within the United Kingdom. Our aim, this election, is to change that with your help ensuring we have an effective and visible pro-Union voice at Westminster. Throughout this manifesto it will refer to people, place, prosperity, public services and peace. It is the 5Ps that underpins delivery; focusing on our economy in order to make Northern Ireland work for all. The Ulster Unionist Party wants to see change in Northern Ireland. We want to see our economy grow through Foreign Direct Investment, by utilising and promoting Small, Medium and Micro enterprises, by promoting a skills agenda and an entrepreneur mentality amongst our wealth generators. We want to see stability and continuity of devolved government that is accountable and transparent adding value to daily life in Northern Ireland. This manifesto is for you, and it is you who has the ability to create real change in Northern Ireland. It is now down to you, you have one vote, on one day with one chance to deliver change. If you want change, vote for change, vote for the Ulster Unionist Party on 4th July and create the future we all want for our children. THE UNION. The Ulster Unionist Party stands firm in our commitment to safeguarding Northern Ireland's integral position within the United Kingdom. During this potentially significant General Election, we wish to underscore the profound importance of the Union, historically and in the present day and continue to fight for its preservation. Northern Ireland's bond with the United Kingdom is rooted deeply in history, going back for centuries. It is a testament to our shared values, culture, and identity that it has endured through many trials and triumphs.",
        "The Union has provided stability, security and a framework for progress, enabling Northern Ireland to thrive within the broader British family. The practical benefits of Northern Ireland's Union with the rest of Great Britain are multifaceted and encompass all aspects of life. The United Kingdom offers Northern Ireland unparalleled economic advantages. It allows for trade with the rest of the UK and provides access to global markets through the UK's extensive network of trade agreements. This strengthens Northern Ireland's economy, creates jobs, and stimulates innovation, ensuring a brighter future for generations to come. One of the most cherished benefits of the Union is access to the National Health Service (NHS). The NHS delivers universal healthcare, providing high- quality medical services to all regardless of their means, free at the point of use, giving us access to hospitals, GPs surgeries and prescription medicines, ensuring our families’ health and well-being are safeguarded. The UK’s Armed Forces, where the people of Northern Ireland are over-represented by share of population, guarantees the defence and security of Northern Ireland. In an increasingly dangerous world, His Majesty’s Armed Forces and military provides protection from external threats and upholds the rule of law, fostering a safe environment for us all to live, work, and prosper. Ulster Unionists are grateful for the protection our Armed Forces provide the United Kingdom and will be steadfast in our support for service personnel, veterans and their families across the United Kingdom. The Ulster Unionist Party is seeking to secure seats in the Westminster Parliament to champion Northern Ireland's concerns and aspirations. We will actively engage in parliamentary debates, committees, and legislation, advocating for policies that benefit Northern Ireland and uphold its position within the United Kingdom. “Beyond the House of Commons, we will work diligently to engage with the UK government, Whitehall departments, and policymakers in London. We will strive to ensure that Northern Ireland's interests are at the forefront of decision-making processes, influencing policies that impact our economy, society, and security.” WINDSOR FRAMEWORK. The Ulster Unionist Party is committed to defending and promoting Northern Ireland's place within the United Kingdom. During this General Election, we reaffirm our dedication to upholding the principles of the Union and ensuring that the interests of Northern Ireland are safeguarded at all levels of government.",
        "The Windsor Framework represents a stepping-stone in addressing the challenges posed by the Northern Ireland Protocol, a protocol that we have campaigned against since it was forced upon Northern Ireland. While the UUP acknowledges the progress made through negotiations, we remain vigilant in scrutinising the outworking of the Framework, and future negotiations between Westminster and the EU, to ensure that Northern Ireland's place within the UK internal market is fully restored. We recognise the complexities and nuances of the Windsor Framework and acknowledge that further reforms will be necessary to address constantly developing concerns. The UUP will actively engage in democratic scrutiny processes, both within the Northern Ireland Assembly and other relevant bodies, to challenge aspects of the Framework that undermine Northern Ireland's sovereignty and economic prosperity. The recent resumption of the Northern Ireland Assembly is a positive step towards restoring effective governance and representation for the people of Northern Ireland. The UUP is fully engaged in the Assembly's role in scrutinising legislation, holding the Executive to account, and representing the diverse interests of the people of Northern Ireland. Using our representation on the Windsor Framework Democratic Scrutiny Committee of the Northern Ireland Assembly, the Ulster Unionist Party have already highlighted genuine concerns that this mechanism is already not fit for purpose. The ability to effectively assess legislation and policies emanating from the EU that might impact Northern Ireland's position within the UK is greatly reduced by the inability of the Scrutiny Committee to act in a collegiate manner. We will work with a new government at Westminster to challenge any attempts to erode Northern Ireland's sovereignty or undermine the integrity of the Union and will campaign to have the existing scrutiny processes reviewed and replaced with structures that guarantee that safeguard. GOVERNANCE. OPPORTUNITIES. CHALLENGE. In Westminster, the UUP will utilise any seats gained in the 2024 General Election to represent Northern Ireland's interests forcefully and effectively. We will advocate for policies that promote economic growth, protect our healthcare system, and ensure Northern Ireland's voice is heard in national debates while also challenging, the out workings of the Windsor Framework that cause further divergence between GB and Northern Ireland. Through active engagement in democratic processes, robust scrutiny of legislation, and effective representation in Westminster, we will ensure that Northern Ireland's interests are protected and advanced.",
        "With a steadfast commitment to the principles of the Union, the UUP will strive to secure a prosperous and secure future for all the people of Northern Ireland within the broader British family. The Ulster Unionist Party is dedicated to defending and promoting Northern Ireland's place within the Union with the rest of Great Britain. EMBRACING. LEADING. PROVIDING."
    ]
}