{
    "Alliance": "Alliance Leading Change for Everyone. KEY POLICIES. Delivering an improved financial settlement for Northern Ireland. Revising fiscal rules to account for the costs of environmental inaction. Creating a Green New Deal to decarbonise our economy. Repairing the UK-EU relationship, including negotiating a comprehensive Veterinary Agreement. Securing dedicated funding for integration, early years, and early intervention projects as a successor to Fresh Start. Alliance is already leading change on better health outcomes, making our communities safer, expanding inclusive education and delivering affordable childcare. In this Westminster manifesto, we have set out our policy priorities for the next five-year term. We have focused specifically on those matters over which Westminster has direct control or influence. Crucially, we can use increased influence at Westminster to unlock a fairer financial deal for Northern Ireland. I am determined to help restore trust by promoting transparency, accountability, and integrity in public life. It has been my greatest privilege to represent North Down in Westminster over the past four years. I am proud of my track record: delivering on behalf of my constituents and making their voices heard. Without reform, current UK fiscal policy is inhibiting investment, reinforcing climate inaction and storing up environmental, social and financial crises for the future. We want to see: • Changes to the Fiscal Rules, so the impact of public spending decisions on the UK’s overall asset base (or wealth) is reflected, rather than just its impact on debt. This would better capture and reflect the costs associated with Climate inaction, unlock vital investment in struggling public services. Westminster can and should do more to enable NI’s growth. We want to see: • The promotion of dual market access for Northern Ireland. The Windsor Framework provides NI with a relative opportunity compared to the rest of the UK. We reject the current rhetoric around migrants and asylum seekers. We want to see: • An overhaul of the visa system to make it more affordable and the removal of cruel minimum threshold salary requirements for family visas. • The creation of safe routes for asylum seekers to reduce exploitation and trafficking. Alliance is guided by our liberal internationalist values and our commitment to the rules-based international order. The world is an uncertain place, faced with many challenges. With these principles in mind, Alliance will work towards a two-state solution in the Middle East, based on international law.",
    "Conservative": "We are restoring our economic stability after Covid and Ukraine. Infation is down, real wages are up, growth has returned. This did not happen by accident. The economy is turning a corner because we built strong economic foundations before the pandemic. We must stick with the plan – a plan that has given four million more people the security and purpose of a job, cut taxes for 29 million working people, protected pensioners with the Triple Lock, delivered more than 2.5 million homes, recruited record numbers of police officers to cut crime by more than 50%. The alternative is we go back to square one.",
    "DUP": "On 4th July voters will face a clear choice at this General Election. Do they want to elect those who will go to our national Parliament and unashamedly make the case for Northern Ireland within the Union, wanting to promote it and do the best for it or will they be represented by people who won’t go or who will spend their time talking Northern Ireland down? The Democratic Unionist Party has an experienced track record of speaking up for you on issues that matter. On 4th July we seek your support to elect Democratic Unionist Members of Parliament who are committed to... PROMOTING THE UNION. Working as a strong DUP team to promote and strengthen the case for the Union between Northern Ireland and the rest of the United Kingdom in Parliament. Northern Ireland is on course to be the first region in Europe to have 100% fibre broadband availability because of £150 million delivered by DUP MPs. A recent Ofcom report found that 91 per cent of all premises in Northern Ireland have access to full-fibre broadband. The DUP made the retention of the triple lock on pensions a key pillar of our Confidence and Supply Agreement with the Government in 2017. DUP MPs secured almost £5 million through the Union Connectivity Review. They also obtained a Government commitment to improving the connections between Northern Ireland and Great Britain. It is now accepted that going forward Treasury’s contribution to public services in Northern Ireland must be on the basis of assessed need. DUP Leader Gavin Robinson promoted the significant contribution Spirit Aerospace, Thales, Harland and Wolff in creating high-quality jobs in Northern Ireland. He has campaigned to deliver significant Ministry of Defence contracts to help secure their future. The DUP also secured a Government commitment to launch a review into Northern Ireland’s role in the UK defence network. DUP MPs successfully fought to extend legislation exonerating sub-postmasters wrongly convicted as a result of Horizon IT scandal to Northern Ireland. Religious Freedom. They have been consistent advocates for freedom of religion or belief both in the United Kingdom and across the globe. Help for working families by launching the ‘Intermediate Rent’ product. Approved the Northern Ireland Football Fund – £36 million fund of investment into performance clubs, grassroots clubs and a National Training Centre. Introduced legislation for defective premises - a bill introduced by accelerated passage to ensure homeowners in Northern Ireland enjoy the protections offered elsewhere in the UK.",
    "Green": "The Green Party’s 2024 Manifesto for a Fairer, Greener Country is taking place during an ongoing cost of living crisis. No wonder so many of us feel anxious and are losing hope in the future. We live in one of the richest countries on the planet, and yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and a hospital appointment or a dentist is like gold dust. Our promise to you This manifesto sets out what we think is achievable given the failure of successive governments to prepare with anything like the urgency and ambition that climate scientists have been telling us is needed for decades. The current UK commitment to net zero by 2050 fails to reflect that we can – and must – do so much more. An economy in which it’s cheaper to heat our homes, to get out and about and to run a business.",
    "Labour": "Change Labour Party Manifesto 2024 is about change. A chance to stop the endless Conservative chaos that has directly harmed the finances of every family in Britain. A rebuilding of our country so that it once again serves the interests of working people. Restore hope. Every great nation is held together by shared beliefs. We must turn the page decisively on the Conservative ideas that have caused the chaos. The world has become increasingly volatile, with a major war in Europe for the first time in a generation. This ‘age of insecurity’ requires the government to step up, not stand aside. It also requires an enduring partnership with business to deliver the economic growth we need. A new Britain, where wealth is created in every community. Where your town centre has been revitalised and everyone feels safe to walk the streets. Where our children are equipped with the skills to thrive in the future. Where Our NHS is once again at the cutting edge of healthcare. Put up Great British Energy to cut bills for good and boost energy security. Recruit 6,500 new teachers in key subjects to prepar children for life, work and the future. Turn the page with a new government is not enough to tackle the deep-rooted challenges our country now faces. Break down barriers to opportunity by reforming childcare and education systems. Build an NHS fit for the future that is there when people need it. Building on these secure foundations, we have already set out the first steps for change.",
    "LibDem": "This election is our chance to win the change our country desperately needs. Everywhere I go across our great United Kingdom, I see people from all backgrounds and all walks of life, working hard, raising families, playing by the rules. But they have been let down and taken for granted for far too long by this out-of-touch Conservative Government. The Conservatives have plunged the NHS into crisis, failing to deliver the new hospitals they promised and making people wait hours for an ambulance. Britain has overcome big challenges before and we can do it again now. For more than 150 years, Liberals and Liberal Democrats have led the fight for a fair, free and open society. Today, our fair deal would give everyone the power to make the most of their potential, and real freedom to decide how they live their lives. It would call the over-powerful to account. It has five key themes. Liberal Democrats will invest in improving public health, expanding early access to health services, and fixing social care. We will give every child the support they need with more specialist teachers, free school meals for all children in poverty, and a dedicated mental health professional in every school. We will repair the broken safety net that currently consigns so many to poverty. We will reverse Conservatives’ damaging cuts to the Army and international development. We will work across borders to provide safe and legal routes to sanctuary for refugees and tackle common threats such as human trafficking and cybercrime.",
    "PlaidCymru": "Plaid Cymru is a party for the whole of Wales. Our candidates are rooted in their communities and passionate about overcoming the challenges facing our economy and public services. Secure £4bn owed to Wales from HS2 to invest in improving public transport. Demand a fair funding system for Wales, based around our needs. A new Cancer Strategy to ensure cancers are caught and treated earlier. Help 330,000 Welsh families to deal with cost of living crisis by increasing Child Benefit by £20 per week. This will take 60,000 children out of poverty in Wales.",
    "Reform": "Our Contract with You is a serious plan to reshape the way our country is run. Only Reform UK will stand up for British culture, identity and values. We will unlock Britain’s vast energy treasure of oil and gas. It sets out the reforms that Britain needs in the first 100 days following a general election and thereafter. It has been produced with advice from independent economists, think tanks and advisors on costs and savings. We have also included extra growth assumptions from our economic reforms. Fourteen years of Tory failure are coming to an end. A Labour government would ramp up mass immigration, crime, and taxes even further. Unlock Britain’s vast oil and gas reserves to beat cost of living crisis. Vote for reform UK on July 4th.",
    "SDLP": "It is the clearest opportunity we have had in more than a decade to put an end to the politics of austerity, isolation and division that have driven governments for 14 brutal years. It is a chance for Northern Ireland not just to send a message against failed policies of Austerity and ever-hardening Tory nationalism. For months now, SDLP representatives have been speaking to people from every background and in every community across the North. We’ve secured almost £100m for university expansion in the North West. We delivered a step change in investment from the Irish Government through the Shared Island Unit worth more than £1bn for projects like Narrow Water Bridge, the A5, Casement Park and far more. On 4th July, take that chance. Vote SDLP. Our Priorities for Change: A New Start. Improved Funding Model for NI. Repeal the Legacy Act. A Fairer Economy for All. Recognise the State of Palestine and end arms exports to Israel. Restore nature and support a just transition.",
    "SinnFein": "Sinn Féin is on the side of workers and families, working nationally and delivering locally. The election on July 4th is a real opportunity to step forward towards a better future. We are focused on what is possible to achieve if we work together, making politics work, and demonstrating positive change is possible. Sinn Féin MPs will work hard and deliver on things that matter to workers, families and businesses. Change will only be delivered in the North by all of us working together in the Executive and Assembly, but this election gives people a chance to send a clear message about the future they want.",
    "SNP": "VOTE SNP FOR SCOTLAND TO BECOME AN INDEPENDENT COUNTRY. I believe people are crying out for principled leadership. In this election, and in this manifesto, that is what the SNP is offering. We’ve grown the economy faster, per head, than the UK. We have the best performing core A&E units in the UK, and we’ve built 40% more affordable homes per head than in England. All the key decisions over our economy, taxes, and spending will transfer from Westminster to Scotland. To remove the Tories from office, to put the interests of Scotland first, and for a future made in Scotland, vote SNP. Demand the devolution of new borrowing powers to invest in a just transition. Support the abolition of the undemocratic House of Lords. Empower workers by scrapping exploitative zero hours contracts and banning callous ‘fire and rehire’ practices.",
    "TUV": "TUV has told you the truth about the iniquitous Protocol from the beginning. To anyone who cares about the Kingdom, this is the core issue. I urge you to vote TUV - No Sea Border. You can make that clear on 4th July by voting TUV - No Sea Border. Jim Allister KC MLA TUV Leader. IMPACTING ON NATIONAL POLITICS. Reform UK and TUV will cooperate in providing and mutually supporting candidates in Northern Ireland. This agreement has put the Sea Border right at the heart of this election campaign. It commits what is now the second largest party in polling UK wide to restore Northern Ireland’s place as a full and equal part of the nation. For far too long Unionism has been parochial and detached from the politics of the entire nation. The historic link up between TUV and Reform UK changes that.",
    "UUP": "Elections are about people and none are more important than a General Election. On the 4th July ordinary people will decide who they believe is best placed to represent them over the next 5 years. Northern Ireland’s representation has been poorer for not having Ulster Unionist MPs making the case for Northern Ireland and our place within the United Kingdom. The United Kingdom offers Northern Ireland unparalleled economic advantages. It allows for trade with the rest of the UK and provides access to global markets through the UK's extensive network of trade agreements. One of the most cherished benefits of the Union is access to the National Health Service. The Windsor Framework represents a stepping-stone in addressing the challenges posed by the Northern Ireland Protocol. We recognise the complexities and nuances of the Windsor Framework and acknowledge that further reforms will be necessary to address constantly developing concerns. The UUP will actively engage in democratic scrutiny processes to challenge aspects of the Framework that undermine Northern Ireland's sovereignty. Ulster Unionist Party is dedicated to defending and promoting Northern Ireland's place within the Union with the rest of Great Britain. EMBRACING. LEADING. PROVIDING."
}