{
    "Alliance": "Alliance Leading Change for Everyone. KEY POLICIES. Delivering an improved financial settlement for Northern Ireland. Revising fiscal rules to account for the costs of environmental inaction. Creating a Green New Deal to decarbonise our economy, protect workers, tackle fuel poverty, and create thousands of jobs. Securing dedicated funding for integration, early years, and early intervention projects as a successor to Fresh Start. Alliance is growing as more people recognise that a divided society means less for everyone. The cost of division means hundreds of millions of pounds less to invest each year in what really matters to you. I have championed calls for the UK Government’s fiscal rules to adopt a more long-term approach to investment. The Alliance Party has pioneered the concept of a Green New Deal for Northern Ireland, aiming to create new green jobs and promote social justice. Northern Ireland is not adequately funded to reflect relative need. To sustain and transform our education, health and justice systems, we need fair funding. Alliance will work to secure a base-lined fiscal floor, set above 124. In 2021, Alliance published the Green New Deal that sets out our plan for a fair, green economy. Since then, energy prices and the cost of living have reached a crisis point due to the Conservative Government's reckless inaction and u-turns on critical climate pledges. Alliance believes: • Energy security is more important than ever. We need a UK-wide emergency retrofitting programme to reduce emissions and tackle fuel poverty. We believe Brexit was and continues to be fundamentally destructive for the UK as a whole. For Northern Ireland, it poses huge challenges for our economy, environment, society and wider political stability. We want to improve its implementation to help people and businesses in NI.",
    "Conservative": "We are restoring our economic stability after Covid and Ukraine. Infation is down, real wages are up, growth has returned. This did not happen by accident. The economy is turning a corner because we built strong economic foundations before the pandemic. We must stick with the plan – a plan that has given four million more people the security and purpose of a job, cut taxes for 29 million working people, protected pensioners with the Triple Lock, delivered more than 2.5 million homes, recruited record numbers of police officers to cut crime by more than 50%. The alternative is we go back to square one.",
    "DUP": "On 4th July voters will face a clear choice at this General Election. Do they want to elect those who will go to our national Parliament and unashamedly make the case for Northern Ireland within the Union, wanting to promote it and do the best for it? The Democratic Unionist Party has an experienced track record of speaking up for you on issues that matter. On 4th July we seek your support to elect Democratic Unionist Members of Parliament who are committed to... PROMOTING THE UNION. Working as a strong DUP team to promote and strengthen the case for the Union between Northern Ireland and the rest of the United Kingdom in Parliament. REMOVING BARRIERS WITHIN THE UK. Campaigning to ensure Northern Ireland is fully protected in law against illegal immigration. DUP MPs have secured significant investment for driving growth, creating jobs and generating prosperity in every corner of Northern Ireland. This included working with UK Ministers to unlock £350 million from the Government for the Belfast Region City Deal, which will create up to 20,000 new jobs, build new world-class visitor experiences and support the regeneration of our towns and cities. Securing a new £10 million fund to boost investment in strategically important ports linking Northern Ireland and Great Britain. The DUP has challenged, and will continue to challenge, the Government to remedy low levels of financial support awarded to projects in Northern Ireland under the UK Shared Prosperity Fund. They deserve to be treated fairly and equitably in the provision of key services. In the last term, DUP MPs: supported the Armed Forces Act 2021. DUP MPs successfully fought to extend legislation exonerating sub-postmasters wrongly convicted as a result of Horizon IT scandal to Northern Ireland. The DUP in Parliament has supported calls for comprehensive compensation for the victims of the infected blood scandal. Our MPs signed an Early Day Motion in July 2023. DUP MPs worked closely with colleagues in the Assembly to seek the introduction of a Baby Loss Certificate scheme in Northern Ireland. Since the restoration of devolution in February, DUP Ministers have been to the forefront of delivering results for households, businesses and workers.",
    "Green": "The Green Party’s 2024 Manifesto for a Fairer, Greener Country is taking place during an ongoing cost of living crisis. No wonder so many of us feel anxious and are losing hope in the future. We live in one of the richest countries on the planet, and yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and a hospital appointment or a dentist is like gold dust. Our promise to you This manifesto sets out what we think is achievable given the failure of successive governments to prepare with anything like the urgency and ambition that climate scientists have been telling us is needed for decades. The current UK commitment to net zero by 2050 fails to reflect that we can – and must – do so much more. An economy in which it’s cheaper to heat our homes, to get out and about and to run a business.",
    "Labour": "Change Labour Party Manifesto 2024 is about change. A chance to stop the endless Conservative chaos that has directly harmed the finances of every family in Britain. A rebuilding of our country, so that it once again serves the interests of working people. Restore hope. Every great nation is held together by shared beliefs. To outsiders they may not seem exceptional or distinctive, but they are essential for a sense of collective national purpose. The world has become increasingly volatile, with a major war in Europe for the first time in a generation. This ‘age of insecurity’ requires the government to step up, not stand aside. But it also requires an enduring partnership with business to deliver the economic growth we need. It demands a final and total rejection of the toxic idea that economic growth is gifted from the few to the many. I want the chance to bring that change to the country. To succeed we need everyone, every community, to play their part. It is time to change Britain. My first steps for change. Labour’s five missions to rebuild Britain are: Kickstart economic growth to secure the highest sustained growth in the G7. Make Britain a clean energy superpower to cut bills, create jobs and deliver security with cheaper, zero-carbon electricity by 2030, accelerating to net zero. Break down barriers to opportunity by reforming childcare and education systems, to make sure there is no class ceiling on the ambitions of young people in Britain.",
    "LibDem": "This election is our chance to win the change our country desperately needs. Families and pensioners are struggling with sky-high energy bills, food prices and housing costs. The Conservatives have plunged the NHS into crisis, failing to deliver new hospitals they promised and making people wait hours for an ambulance. They are letting water companies get away with pumping filthy sewage into our rivers and lakes and onto our beaches. Liberal Democrats and Liberal Democrats have led the fight for a fair, free and open society. Today, our fair deal would give everyone the power to make the most of their potential, and real freedom to decide how they live their lives. It would call the over-powerful to account. It has five key themes. We will fund public services through fair taxes, such as reversing the Conservatives’ tax cuts for big banks. The UK can lead the world with innovation and ingenuity, while boosting the economy and enhancing everyone’s quality of life. We will put tackling climate change at the heart of a new industrial strategy. We will champion the UK’s Human Rights Act and resist any attempts to weaken or repeal it. Our goal is to transform the nature of British politics itself.",
    "PlaidCymru": "Plaid Cymru is a party for the whole of Wales. Our candidates are rooted in their communities and passionate about overcoming the challenges facing our economy and public services. Secure £4bn owed to Wales from HS2 to invest in improving public transport. Demand a fair funding system for Wales, based around our needs. A new Cancer Strategy to ensure cancers are caught and treated earlier. Help 330,000 Welsh families to deal with cost of living crisis by increasing Child Benefit by £20 per week. This will take 60,000 children out of poverty in Wales.",
    "Reform": "Brexit is the opportunity of a lifetime. Our country is full of talent and energy. Both Labour and Tory governments have broken promise after promise. The economy is being wrecked by record high taxes, record high national debt, wasteful government spending and nanny state regulations. Our Contract with You covers the most important areas of policy for you and your family. We have summarised these into five core pledges: Imagine Smart Immigration, Not Mass Immigration All non-essential immigration frozen to boost wages, protect public services, end the housing crisis and cut crime. Imagine No NHS Waiting Lists Still free at the point of delivery, healthcare needs reform to improve outcomes and enjoy zero NHS waiting lists. This takes 7 million of the least well-off out of Income Tax to make work pay and get people off benefits. Imagine Affordable, Stable Energy Bills Scrap energy levies and Net Zero to slash energy bills and save each household £500 per year. Vote Reform UK to get reform.",
    "SDLP": "It is the clearest opportunity we have had in more than a decade to put an end to the politics of austerity, isolation and division that have driven governments for 14 brutal years. It is a chance for Northern Ireland not just to send a message against failed policies of Austerity and ever-hardening Tory nationalism, but to send MPs that will use their voice and their influence to fight for all the people of this region. We’ve secured almost £100m for university expansion in the North West. We delivered a step change in investment from the Irish Government through the Shared Island Unit worth more than £1bn. On 4th July, take that chance. Vote SDLP. Our Priorities for Change: A New Start - Remove this Tory Government from power. Better Public Services for All – reduce hospital waiting lists with additional investment in health. Improved Funding Model for NI. Repeal the Legacy Act. A Fairer Economy for All. Recognise the State of Palestine and end arms exports to Israel. Restore nature and support a just transition.",
    "SinnFein": "Sinn Féin is on the side of workers and families, working nationally and delivering locally. The election on July 4th is a real opportunity to step forward towards a better future. We are focused on what is possible to achieve if we work together, making politics work, and demonstrating positive change is possible. Sinn Féin MPs will work hard and deliver on things that matter to workers, families and businesses. Change will only be delivered in the North by all of us working together in the Executive and Assembly, but this election gives people a chance to send a clear message about the future they want.",
    "SNP": "VOTE SNP FOR SCOTLAND TO BECOME AN INDEPENDENT COUNTRY. \"We will put the interests of the people of Scotland first, and protect public services like our cherished NHS\" John Swinney MSP, Leader, Scottish National Party. Deliver independence to strengthen our economy. Rejoin the EU, reverse the damage of Brexit and re-enter the single market restoring free movement for EU citizens. Protect our NHS from the twin threats of Westminster privatisation and austerity. Scrap the Rwanda scheme and stand firm against the demonisation of migrants. Tackle the drugs death crisis by taking a radical public health approach. Decriminalising drugs for personal use.",
    "TUV": "TUV has told you the truth about the iniquitous Protocol from the beginning. To anyone who cares about the Kingdom, this is the core issue. I urge you to vote TUV - No Sea Border. You can make that clear on 4th July by voting TUV - No Sea Border. Jim Allister KC MLA TUV Leader. IMPACTING ON NATIONAL POLITICS. Reform UK and TUV will cooperate in providing and mutually supporting candidates in Northern Ireland. This agreement has put the Sea Border right at the heart of this election campaign. It commits what is now the second largest party in polling UK wide to restore Northern Ireland’s place as a full and equal part of the nation. For far too long Unionism has been parochial and detached from the politics of the entire nation. The historic link up between TUV and Reform UK changes that.",
    "UUP": "Elections are about people and none are more important than a General Election. On the 4th July ordinary people will decide who they believe is best placed to represent them over the next 5 years. Our aim, this election, is to change that with your help ensuring we have an effective and visible pro-Union voice at Westminster. Ulster Unionist Party seeks to secure seats in Westminster Parliament to champion Northern Ireland's concerns and aspirations. The Windsor Framework represents a stepping-stone in addressing the challenges posed by the Northern Ireland Protocol. The UUP is fully engaged in the Assembly's role in scrutinising legislation, holding the Executive to account, and representing the diverse interests of the people of Northern Ireland. Ulster Unionist Party have already highlighted genuine concerns that this mechanism is already not fit for purpose. We will work with a new government at Westminster to challenge any attempts to erode Northern Ireland's sovereignty or undermine the integrity of the Union."
}