{
    "Alliance": "Northern Ireland is not adequately funded to reflect relative need. To sustain and transform our education, health and justice systems, we need fair funding.",
    "Conservative": "Under the Conservatives, violent crime has fallen by 44% since 2010. Reofending has fallen from over 30% in 2010 to 25%. We have recruited 20,000 police ofcers, delivered 6,000 prison places as part of the largest prison expansion since the Victorian era and deported over 18,000 foreign national ofenders since 2019 alone. We have made violence against women and girls a strategic policing requirement for the frst time. We have strengthened the law to punish predators with new ofences for stalking, controlling or coercive behaviour, non-fatal strangulation and sufocation, sharing of intimate images or ‘revenge porn’ and raised the maximum penalties for harassment. Our Domestic Abuse Act created a statutory defnition of domestic abuse and gave new powers to police and the courts. We will build four new prisons, completing our programme of 20,000 new prison places by 2030. We will remove more Foreign National Ofenders by increasing removals under the Early Removal Scheme and negotiating more Prisoner Transfer Agreements. Our Victims and Prisoners Act ensures victims are protected and supported. We have passed tough new laws to curb disruptive protests. Our Public Order Act 2023 gave the police new powers to intervene. We will introduce further powers to ban face coverings, pyrotechnics and climbing. From September 2025, all eligible parents with children from nine months old to when they start school will be able to access 30 hours of free childcare a week. To help the childcare sector expand we have committed to increasing hourly funding rates over the next two years by an estimated £500 million. We are investing £300 million so that all parents can access wraparound childcare before and after school by September 2026. In the last decade, we have done more to protect children online than any other country. From next year, our Online Safety Act will make it a legal requirement for social media frms to protect kids from illegal or harmful content online. We will put our guidance on banning mobile phones in the school day on a statutory footing.",
    "DUP": "In Northern Ireland, there is an enduring threat posed by dissident republicans. The repugnant and life-changing attack on DCI John Caldwell underlines the need for a sustained, laser-sharp focus on rooting out those still intent on perpetrating murder and bloodshed on our streets. We welcome the role played by the national intelligence community in helping to erode the capabilities of splinter groups like the New IRA and to take prominent terrorists out of circulation. We will: 3 campaign to ensure that smaller and emerging social media platforms and sites hosting potential harmful content are subject to regulatory controls and Ofcom oversight. 3 oppose a lower minimum age for social media use, recognising that: • it is wrong to penalise children and young people for the failures of platforms; • it could dilute focus on more proactive regulation by big tech companies; 3 consider the merits of a duty of candour. The DUP has delivered on our policy of a Troubles victims’ pension. 3 overseen a fundamental reform of victim support services; 3 created a Victims Commission. 4 quadrupled the level of funding provided to victims and survivors. 3 vociferously opposed the Northern Ireland Troubles (Legacy and Reconciliation) Act 2023; 3 ensured no Troubles-era offender could gain immunity from prosecution for sexual offences; 3 proposed a new and bespoke criminal offence of glorifying terrorism; 3 delivered the Troubles pension for innocent victims. 3 supported the Omagh families’ call, and the High Court’s recommendation, for a public inquiry; 3 tabled a debate in Parliament on the findings of the Kingsmill Massacre  In more than a decade, there has been a 3% growth in the policing and justice budget compared to 70% and 45% for health and education respectively. The most visible symptom of this rising crisis is the loss of police officers. The outworking, of course, is slower response, a reduced neighbourhood presence and fewer detectives. Violence Against Women & Girls DUP MPs will: 3 seek to address gaps in funding for specialist support for survivors of domestic abuse; 3 support robust and up-to-date vetting in police forces across the UK; 3 promote a review of arrangements governing the disclosure of victims’ personal information in sexual and domestic abuse cases; 3 call on the Government to review the ‘No Recourse to Public Funds’ (NRPF) for migrants who suffer domestic abuse and are at risk. 3 pressing for stronger custodial sentences",
    "Green": "Greens recognise it’s time to do more - so we will tackle structural injustice. We will focus on prevention of crime through restoring funding withdrawn from youth services since 2010 and through community-based policing. Elected Greens will work to: • Restore trust and confidence in the police. Bringing Justice to Crime and Policing Prison is a demonstrably ineffective way of reducing reoffending. There are some people who need to be imprisoned for reasons of public safety or the seriousness of their offence. For others a restorative approach, forcing criminals to take responsibility for the consequences of their actions, is better for the offender, the victim and society at large. The Green Party welcomes the greater emphasis on diversion in the criminal justice system. In Scotland, the introduction of violence reduction units has delivered a welcome decrease in violence. Elected Greens will push for more local control over public services. Communities across the country experience youth violence in particular. Many of the Green Party’s proposals will, over time, reduce the level of violence affecting young people. Greens will not allow our country to be held back by fiscal rules that don’t serve us all – we’re prepared to tax wealth and carbon emissions and prepared to borrow to invest in a fairer future. We are one of the most nature-depleted countries in the world with about half of our nature lost. The experiment of water privatisation has been an unmitigated disaster, with routine discharges of filth into our water courses. The Act would also set standards for soil quality and phasing out the most harmful pesticides immediately (including glyphosate) Only pesticide that pass this test would be approved for use in UK. Elected Greens will also push for a Clean Air Act, which will set new air quality standards for the UK. We would enshrine the right to breathe clean air in the law.",
    "Labour": "Labour has a straightforward vision for policing and criminal justice. When you call the police, they should come. Prisons should not be academies of crime. More victims are being let down. Labour will restore neighbourhood policing with thousands of extra officers. We will tackle the epidemic of serious violence, with a greater focus on prevention, including by holding those companies and executives cashing in on knife crime personally to account. To get knives off our streets Labour will ban ninja swords, lethal zombie-style blades and machetes, and strengthen rules to prevent online sales. We will intervene earlier to stop young people being drawn into crime, creating a new Young Futures programme with a network of hubs reaching every community. These hubs will have youth workers, mental health support workers, and careers advisers on hand to support young people’s mental health. To offer young people a pathway out of violence, we will Labour will introduce a new criminal offence for spiking to help police better respond to this crime. We will strengthen the rights and protections available to women in co-habiting couples, as well as for whistleblowers in the workplace, including on sexual harassment. Labour will reverse this, driving up the proportion of crimes solved by reducing barriers to bringing charges. We will roll out a direct entry scheme for detectives to boost investigation skills. A justice system that puts victims first After 14 years of neglect, the criminal justice system is broken. In Greater Manchester, probation is linked up with housing and health services to ensure offenders leave custody receive the support they need. Labour will conduct a strategic review of probation governance, including considering the benefits of devolved models. Under the Conservatives, too many victims of historical injustices have had insult added to injury by years of legal delays. Labour will stop the chaos and go after criminal gangs who trade in driving this crisis. We will create a new Border Security Command, with hundreds of new investigators, intelligence officers, and cross-border police officers. This will be funded by ending the wasteful Migration and Economic Development partnership with Rwanda.",
    "LibDem": "Conservatives have talked tough on crime, but failed even to get the basics right. Serious violence is destroying too many young lives. Our communities are plagued by burglaries, fraud and anti-social behaviour. Huge backlogs in the courts are denying victims the justice they deserve. Introducing the Hillsborough Law: a statutory duty of candour on police officers and all public officials. • Urgently drawing up a national recruitment, training and retention strategy to tackle the shortage of detectives by reforming the Police Remuneration Review Body to make it properly independent of government. • Naming and shaming the banks with the worst records on preventing fraud and reimbursing victims. • Requiring banks to reimburse victims of automated push payment scams unless there is clear evidence that they are at fault. Launching a high-profile public awareness campaign to help people spot, avoid and report frauds.",
    "PlaidCymru": "Plaid Cymru support the full transfer of justice powers to Wales. This will allow us to develop a Welsh way of policing and criminal justice. It makes no sense that many of the policy levers for reducing crime in Wales are held in our Senedd, while others are still held by Westminster. Plaid Cymru recognises scale and challenges of violence against women and girls. There is a need for specialist training and support officers around the issues of coercive control, stalking and an improved understanding of homicide risk. The Victims Commissioner could help increase the number of successful convictions of perpetrators, as part of a series of measures. Sentencing policy should consider what works best to prevent criminals from re-offending and being a danger to the wider public. This includes restorative justice, community based sentences for low-risk offenders and community-based prevention and rehabilitation. Plaid Cymru believes that women are not well served by our criminal justice system. Plaid Cymru supports legislation at Westminster which will require police officers to declare memberships of clubs, societies and organisations to ensure relationships outside of the workplace are transparent and above board. This will provide increased transparency and confidence in policing. We recognise that some drug users are responsible for acquisitive crime in order to fund their dependency. Many users are also dealers and are exploited as part of the crime network. Plaid Cymru believes Dyfed-Powys Police should be compensated for the cost of Westminster’s mistake. It is highly disappointing that large costs of more than £1m have been spent to police protests at Llanelli’s Stradey Park Hotel. We will continue to provide best practice support to serving police and prison officers to deal with the trauma and challenges of dealing with their everyday tasks.",
    "Reform": "CRITICAL REFORMS NEEDED IN THE FIRST 100 DAYS: Commence Increase in Police Numbers Recruitment to increase UK per capita police numbers to 300 per 100k population. That is 40,000 new front-line officers over a 5-year parliament. Increase the Criminal Justice Budget The budget is almost the same as it was 10 years ago. Increase it from £10 billion to £12 billion to ensure more high calibre staff to cut delays. Reopen local magistrates’ courts to clear case backlog. Change the Definition of Hate Crime The CPS and police definition of a hate crime has led to systemic bias. History and social science curriculum to be reviewed and audited regularly to ensure balance. Our children must be taught about their heritage. Ban Transgender Ideology in Primary and Secondary Schools. No gender questioning, social transitioning or pronoun swapping. Inform parents of under 16s about their children’s life decisions. Schools must have single sex facilities. Tax relief of 20% on all Independent Education No VAT on Fees.",
    "SDLP": "Justice, Equality & Rights. Justice, Legacy and Victims. The SDLP will always stand with victims and for truth, justice and accountability. Over recent years, justice has been severely undermined by the UK government at Westminster through the corrosive impact of the toxic Legacy Act. This abhorrent amnesty was an act of serious bad faith that has breached obligations undertaken in all-party agreements and the international treaty further to “the Stormont House Agreement” The SDLP will always lobby for a visible police presence in our communities. This requires a gear change in policing with the community and ensuring no community is managed by “gatekeepers” who exercise undue influence in local areas. Working alongside the SDLP Opposition at Stormont, SDLP MPs will: Ensure the PSNI must be representative of the community it seeks to serve. In the past, SDLP MPs supported the successful Istanbul Convention Bill on preventing and combatting domestic violence against women and girls. This is totally indefensible and must be reversed by the Executive as a matter of urgency.",
    "SinnFein": "Sinn Féin is committed to an inclusive and diverse society based on equal rights and equal opportunities for all citizens. There can be no place for sectarianism, racism, misogyny, homophobia, age or disability discrimination in our society. We want a society that values and celebrates diversity of our identities, religious or none, sexual orientation, gender, disability, age, or ethnic origin. Sinn Féin will continue to advocate for victims and survivors of institutional abuse to protect their right to truth, justice and redress that they have",
    "SNP": "We have lost access to one of the world’s most sophisticated and integrated international justice and crime-fighting ecosystems. Red tape is exacerbating medicine shortages, and the end of freedom of movement has made it much harder to recruit staff to work in our NHS, social care and other vital sectors. A safer Scotland, working",
    "TUV": "There is a huge crisis of confidence in the PSNI within the Unionist community. The reasons are transparent. Blatant two-tier policing must end. There must be no return to the anti-Protestant discrimination of 50/50. Until root problem is addressed there can be no real progress on victims’ issues. The innocent must reclaim the word “victim”. Many victims continue to demand justice and should not be denied this.",
    "UUP": "Policing and Justice were devolved to Northern Ireland in 2010. From that moment it has been mismanaged, poorly resourced and badly understood. Our Courts are struggling to keep up with demand and our Prison Service have been left feeling demoralised and marginalised. Ulster Unionists will campaign for a review of mandatory practice of giving serious offenders a 50/50 custodial sentence allowing for only half of the sentence to be served. Victims need to see a change in culture within the justice system whereby the State is seen to be fulfilling its duty of protecting law abiding citizens. Ulster Unionists want to see our Prison Service given the resources they need. It is important that we reduce the number held on remand in prison by finding alternative methods to deal with those bound over. Speeding up justice which will naturally reduce those on bail as they are dealt with in the court and methods such as electronic tagging must be introduced. The legacy section should be funded by Westminster from an agreed multi-year budget. The LIB and PPS (Legacy) would work within Northern Ireland and engage with other jurisdictions to investigate all troubles related crimes."
}