{
    "Alliance": "Public Sector Net Debt is at a level last seen in the early 1960s. This is after over a decade of damaging austerity initiated by the UK Government. The Truss/Kwarteng Mini Budget compounded the situation by undermining trust and credibility in the UK government. Alliance believes reforming the Fiscal Rules could unlock significant investment. Alliance believes that a Fiscal Floor of 124 does not reflect our relative need in NI versus England. We believe Northern Ireland can become the most innovative and dynamic regional economy in Europe. Establish a UK Export Fund for SMEs, to enable enhanced export orientation.",
    "Conservative": "Cut tax for workers by taking another 2p of employee National Insurance so we will have halved it from 12% at the beginning of this year to 6% by April 2027, a total tax cut of £1,350 for the average worker on £35,000.  Cut taxes to support the self-employed by abolishing the main rate of Self-employed National Insurance entirely by the end of the Parliament.  Increase NHS spending above infation every year, recruiting 92,000 more nurses and 28,000 more doctors, driving up productivity in the NHS and moving care closer to people’s homes.  Deliver 1.6 million well-designed homes in the right places while protecting our countryside, permanently abolish Stamp Duty for homes up to £425,000 for frst time buyers. The plan we set out last year, to halve infation, grow the economy and reduce debt, is working. Economic security is the bedrock of any future success, which is why we have a clear plan to take the bold action needed to build a strong economy. Reducing debt and borrowing Sustainable public fnances are essential for strong economic plan. We are supporting frms with a business rates support package worth £4.3 billion over the next fve years to support small businesses and the high street. We want small businesses to get a bigger share of public contracts and have improved the public sector procurement system to that end. We have taken 28,000 small businesses out of paying VAT altogether by raising the VAT registration threshold to £90,000. In the next Parliament, we will deliver a ten point plan to support SMEs. In the frst half of this year, we began cutting National Insurance. It is unfair that working people pay two taxes on their income – income tax and national Insurance – when other people only pay income tax. Our long-term ambition is to keep cutting national Insurance until it’s gone, as part of our plan to make the tax system simpler and fairer. As part of that plan, we will have cut employee National Insurance to 6% by April 2027 – meaning that we will halve it from 12% We introduced the National Living Wage in 2016 and this year achieved our ambition of raising it to £11.44 per hour and extending it to cover all workers aged over 21. As a result of our personal tax cuts and increases in the minimum wage, the take-home pay of someone working full-time has gone up by 35% in real terms since 2010. The number of payrolled employees is at a near record high, and there are around four million more people in work than when we came to ofce in 2010. Cutting tax for Under our new Pensions Tax Guarantee, the Conservatives will not introduce any new taxes on pensions. We will maintain the 25% tax free lump sum and maintain tax relief on pension contributions at their marginal rate.",
    "DUP": "Northern Ireland has the highest proportion of public sector workers in the United Kingdom. Only Scotland’s population is more dispersed. Yet when it comes to distributing money under the Barnett Formula, Northern Ireland receives less than it needs to match public services in England. Campaigning on rare diseases and ensuring Cystic Fibrosis sufferers have access to wonder drug Orkambi. DUP MPs will campaign to increase VAT threshold for SMEs to £100,000 and then uprate it in line with inflation. Progress has been achieved with Invest NI’s global footprint expanded with the support of UK Government funding and more trade advisers recruited. We want to see the next Government go even further. Northern Ireland's first banking hub has been established in Kilkeel. It is a shared service that operates in a similar way to a standard branch. The DUP believes there are a number of fundamental issues that require resolution with the Treasury before the powers to vary corporation tax rates can be enacted.",
    "Green": "Green MPs would work to make this industry a force for good. Any company holding a UK banking licence will be required to present an investment strategy outlining a clear pathway to divestment of its current fossil fuel assets. The Bank of England’s mandate will be changed so that funding the sustainability transition becomes a central objective, alongside the maintenance of price stability. There will be credit bans/ceilings for unsustainable activities. We want to change markets where customers, suppliers and workers are open to exploitation through market dominance. We also want to ensure that structures exist in markets that allow for a competitively fair transition to a zero-carbon economy. It is not acceptable that large companies or public bodies rely on unarranged credit from smaller enterprises to manage their cash flow. Elected Greens will campaign to bring the Prompt Payment Code into law and bar late payers from public-procurement contracts. Elected Greens will campaign to amend Companies Act 2006. The Green Party believes that workers’ and trade union rights need to be restored after decades of decline under successive governments. Too many people are being exploited and underpaid, with too little protection from the law. We will require all large and medium-sized companies to carry out equal pay audits and redress any inequality uncovered. We will campaign for safe sick pay because it’s good for workers, good for employers and good for public health. Every worker deserves equal protection, with full and equal rights from the first day of employment. Elected Greens will take every opportunity to advocate for the most disadvantaged in society. This major change to our tax and social security system is the work of more than one parliament. In the meantime, we will end benefit sanctions and challenge the punitive approach to welfare claimants. Elected Greens will push too for the reform Capital Gains Tax (CGT) by aligning the rates paid by taxpayers on income and taxable gains. This would affect less than 2% of all income-tax payers. We would remove the Upper Earnings Limit that restricts National Insurance paid by high earners. Greens will advocate for a carbon tax to incentivise businesses to decarbonise supply chains and to help raise the money needed to shift to zero-carbon economy. The changes would raise up to an additional £40bn in business taxes during the five years of the next parliament.",
    "Labour": "Every commitment a Labour government makes will be based on sound money and economic stability. We reject this flawed ideology that was tested to destruction by the disastrous Conservative ‘mini budget’. The Conservatives’ recklessness sent a signal of instability across the world. We will reduce food prices by removing barriers to businesses trading. We will make housing more affordable, expand access to childcare, and make work pay. The Conservatives have raised the tax burden to a 70-year high. Labour will bring stability, good jobs and higher living standards. It is Labour’s first mission for government. It means being pro-business and pro-worker. This election follows the chaos of the Conservatives’ ‘mini-budget’. We will use public investment where it can unlock additional private sector investment, create jobs, and provide a return for taxpayers. Britain is hampered by a planning regime that means we struggle to build either the infrastructure or housing the country needs. The country remains too centralised, with the economic potential of too many regions and communities ignored. We will work in partnership with industry to seize opportunities and remove barriers to growth. To realise these opportunities Labour will establish a National Wealth Fund. Capitalised with £7.3 billion over the course of the next Parliament. The fund will have a target of attracting three pounds of private investment for every one pound of public investment, creating jobs across the country. Conservative chaos has seen major projects abandoned, decades-long delays, cost overruns, uncertainty for supply chains, and our infrastructure crumbling. The current planning regime acts as a major brake on economic growth. Labour will make the changes we need to forge ahead with new roads, railways, reservoirs, and other nationally significant infrastructure. Labour will stop the chaos and turn the page to create a partnership between business and trade unions by implementing ‘Labour’s Plan to Make Work Pay: Delivering a New Deal for Working People’ in full. We will consult fully with businesses, workers, and civil society on how to put our plans into practice before legislation is passed.",
    "LibDem": "Liberal Democrats will build a strong, fair economy that benefits everyone in the UK. Core to our economic policy for improving stability and growth will be responsible management of the public finances, fixing the broken trading relationship with Europe, and an industrial strategy focused on the skills the future UK economy will need. Conservatives have badly mismanaged the economy, grinding economic growth to a halt and adding billions to the cost of servicing our debt. Implement a tax policy that recognises how high the Conservatives have raised personal taxes, making the cost-of-living crisis worse. Instead focusing tax changes on reversing the Conservative tax cuts for big banks and imposing a proper, one-off windfall tax on the super-profits of oil and gas producers and traders. • Launching an ambitious industrial strategy to incentivise businesses to invest and create good jobs across the UK. Expand the British Business Bank to perform a more central role in the economy. Empower consumers and ensure everyone can enjoy the benefits of new technology. Introduce a national financial inclusion strategy and require both the Financial Conduct Authority and Prudential Regulation Authority to have regard to financial inclusion. We will: • Develop an industrial strategy that will give businesses certainty and incentivise them to invest in new technologies to grow the economy, create good jobs and tackle the climate crisis. Fix the skills and recruitment crisis by investing in education and training, including increasing the availability of apprenticeships and career advice for young people. • Boost small businesses and empower them to create new local jobs. Ensures the use of personal data and AI is unbiased, transparent and accurate, and respects the privacy of innocent people. Negotiate UK’s participation in the Trade and Technology Council with the US and the EU. • Creating new Lifelong Skills Grants for adults to spend on education and training throughout their lives, as set out in chapter 8. Identifying and seeking to solve skills gaps, such as lack of advanced technicians, by expanding higher vocational training like foundation degrees, Higher National Diplomas and Higher Apprenticeships. Fix the work visa system and expand the Youth Mobility Scheme.",
    "PlaidCymru": "We are living with the legacies of all these examples of the Conservatives’ poor economic judgement, which are being echoed by a Labour Party that has already tied itself to their spending plans. Our public services are underfunded and have been hollowed out, and our economy has stagnated. We want to see a new needs-based funding formula introduced in place of the Barnett Formula. Plaid Cymru would equalise capital gains tax with income tax. We would investigate increasing higher earners’ National Insurance contributions. We would crack down on tax evasion and avoidance, and abolish loopholes. As part of the move towards net-zero, we will establish a National Development Agency for Wales which is fit for purpose as we approach the quarter point of the 21st century. This means a forward-thinking approach that will meet economic challenges into the 2050s and beyond. Our aim will be for the bank to take and profit from greater equity shares in emerging businesses and invest in infrastructure projects. Fairness for Employees. We support the devolution of employment law to Wales. In a world of increasing threats to workers, employment rights desperately need strengthening. We would also support legislation to tackle insecure work.",
    "Reform": "Reform UK will back risk takers and wealth creators. Save £5 in every £100 Every department must slash wasteful spending, cut bureaucracy, improve efficiency and negotiate better value procurement without touching frontline services. Cut Unnecessary Regulations Britain still retains over 6,700 EU laws. Lift the Income Tax Start Point to £20,000 Per Year This frees up to 7 million people from paying Income Tax and saves every worker almost £1,500 per year. Basic Tax rate stays at 20%. The higher rate should begin at £70,000. Cut Energy Taxes, Beat the Cost-of-Living Crisis Save households over £500 per Year. Lower fuel duty by 20p per litre for both residential and business users. Scrap VAT on energy bills. Scrap environmental levies. Abolish VAT Tourist Tax The government Support Small and Medium Sized Enterprises (SMEs) Abolish Business Rates for high street based SMEs. Offset this with Online Delivery Tax at 4% for large, multinational enterprises. Cut entrepreneurs’ tax to 5%. Reform the Planning System Fast-track new housing on brownfield sites and infrastructure projects to boost businesses.",
    "SDLP": "SDLP MPs will work to build a prosperous, world-leading and regionally equitable economy that works for everyone no matter background, circumstance or geography. The SDLP supports the creation of a strategy that is tailored to the sectors that have most to gain from the Protocol/Windsor Framework. SDLP representatives opposed the decision to hand over welfare powers to the British government. We have seen the consequences of that decision play out in communities across Northern Ireland in recent years. The SDLP placed poverty at the top of the agenda at Stormont by devoting an entire Opposition Day to the subject. Arts and culture in Northern Ireland is underfunded, with arts spending per head dramatically lower than any other part of these islands. We support a meaningful increase to arts funding to catch up with other jurisdictions on these islands the delivery of a new Arts, Culture and Heritage Strategy without delay. The SDLP is committed to defending education at all levels as a public good and fully supports properly funding higher and further education to expand opportunities for all people, regardless of backgrounds. Working alongside the SDLP Opposition at Stormont, SDLP MPs will fight for: 1. A full-size university at Magee of at least 10,000 students Achieving a full-sized university in Derry is a critical lever to drive economic development in the region. We also secured millions of pounds of investment from the Irish government through the Share A New Approach to Further & Higher Education We support a new approach to third level education that creates a skills pipeline from schools to colleges and universities. Further education colleges must be supported in tandem with universities to ensure a coherent skills ecosystem. The Department for the Economy must progress the reform of Further Education delivery. SDLP believes in breaking down every barrier to participation in the economy. We must ensure the implementation of legislation on gender pay gap reporting. In addition, we support reform of the full rate equivalent maternity leave which is currently one of the lowest across OECD countries.",
    "SinnFein": "Sinn Féin has been central to the fightback against the negative, cuts-driven and destructive policies of the Tories. We want to increase productivity and opportunities for skills and training, regional balance in investment and job opportunities, accessible and affordable childcare and meet climate change targets through a fair and just transition to net zero.",
    "SNP": "Scotland is an energy-rich nation but without full powers of independence we cannot fully harness the opportunities our vast renewable energy sources provide. We will demand the devolution of powers over energy regulation, pricing and production to ensure that our natural energy resources are used to best serve the needs of the Scottish people. Scotland as a whole should see far more of that benefit, but local communities who house the infrastructure – like pylons and wind farms – should get a much greater degree of benefit. SNP MPs will demand the full devolution of tax powers to enable us to create a fairer system that protects public services and invests in our economy. With the Devolution of National Insurance, we could ensure rates and thresholds fit our progressive income tax rates. We believe it is only right that companies making excess profits shoulder the burden that families face. The SNP is calling on the UK Government to scrap their fiscal rules and introduce new ones to allow greater investment in renewing infrastructure and services. The UK Government must abandon the current trajectory and recognise the value of investing in national infrastructure. Fiscal Rules We’re proposing a sensible alternative, setting out three new fiscal rules.",
    "TUV": "Reform UK will make work pay and help the unemployed to escape benefits trap. Lift Income Tax Start Point to £20,000 per Year. This frees up to 7 million people from paying Income Tax and saves every worker almost £1,500 per year. Basic Tax rate stays at 20%. The higher rate should begin at £70,000. Offset this with Online Delivery Tax at 4% for large, multinational enterprises. Cut entrepreneurs’ tax to 5%. Reform the Planning System Fast-track new housing on brownfield sites. Slash Red Tape to Boost Industry and Exports. Northern Ireland must not be left behind. The profligacy of Stormont must not rob our people of an objectively fair settlement.",
    "UUP": "The Ulster Unionist Party will work at Westminster to seek commitment to lower Leisure and Hospitality VAT in Northern Ireland to match the Republic of Ireland. We will lobby in Parliament to establish a 'Freeport Northern Ireland'. Ulster Unionists are committed to fiscal responsibility and effective financial stewardship. We aim to work with Westminster to gradually reduce Corporation Tax in Northern Ireland to 15%. By implementing necessary reforms and reducing Corporation Tax, we seek to enhance competitiveness, attract investment and drive economic growth throughout Northern Ireland. The 'triple lock' for pensions is a commitment made by the UK government to increase the state pension by the highest of three measures. This ensures that pensioners' incomes keep pace with rising cost of living and national prosperity. The Ulster Unionist Party recognises the vital importance of this policy in providing dignity and security for retirees."
}