{
    "Alliance": "Northern Ireland is not adequately funded to reflect relative need. To sustain and transform our education, health and justice systems, we need fair funding. The British Irish Council should now have a much wider role in enhancing and managing British- Irish relations. Ensure migrants’ and refugees’ qualifications and prior learning are recognised to reflect need in the local economy. Pay particular attention to protecting the rights and well-being of women across the world.",
    "Conservative": "We will build on this success to make sure every child gets a world-class education and reaches their full potential. Today, 90% of schools are Good or Outstanding, up from 68% in 2010. The pupil premium, introduced by the Conservatives in 2011, will allocate almost £3 billion next year to support disadvantaged children. We have hit our 2019 manifesto commitment to introduce starting salaries of £30,000. To keep pace with our global competitors we will introduce the Advanced British Standard. Every young person will spend more time in the classroom, learning more subjects, including English and maths to 18, as they do in most advanced economies around the world. We will continue to work with schools and local authorities to improve school attendance, including through more mental health support. Concept of gender identity is not taught to children. We will expand strong academy trusts. This builds on our record to date. Half of all state-funded schools are now academies. Over 700 free schools have been delivered. We will support the National Citizen Service to help young people build confdence. From 2025 academic year, adults will be able to apply for loans to cover new qualifcations.",
    "DUP": "Delivering for Northern Ireland in Assembly Department of Education Outcomes Delivered: 3 Settled the long-running industrial action by teachers and increased the starting salary for teachers in Northern Ireland to £30,000. 3 Resolving the pay and grading review for educational support staff, including classroom assistants; 3 Announced the biggest step change to education planning for a generation. Childcare for Working Parents The lack of access to affordable, flexible and high-quality childcare has a negative impact on employment and recruitment and retention of staff in frontline services. The DUP Education Minister Paul Givan MLA has announced a fresh package of measures worth £25 million designed to: 3 stabilise and support expansion of the early learning and childcare sector. 3 offer all children 22.5 hours pre-school education per week, and 3 reduce childcare bills for working parents through a Northern Ireland Childcare Subsidy Scheme DUP MPs have opposed the commissioning of abortion services in Northern Ireland and legal instruction from the Government to ringfence funding for this from the block grant. 3 supported legal action by disability campaigner Heidi Crowter against legislation allowing the abortion of babies with Down’s Syndrome up until birth.",
    "Green": "Education should be about inspiring a love of learning and ensuring that every young person can reach their potential. Yet too many children are struggling to achieve in an education system that operates like a production line rather than valuing children’s unique individual qualities. Greens MPs will advocate for an increase in school funding, with an £8bn investment in schools that would include £2bn for a pay uplift for teachers. Private school places for children with special education needs will not be subject to VAT. This will be an interim measure while public-sector capacity is built. Special educational needs Green MPs will push for £5bn to be invested in special needs provision within mainstream schools. This means that all schools will have fully accessible buildings and specially trained teachers. Elected Greens will champion public transport for every community to thrive. Green MPs will push to increase annual public subsidies for rail and bus travel to £10bn by the end of the next parliament.",
    "Labour": "Break down barriers to opportunity • Recruit 6,500 new expert teachers in key subjects • 3,000 new primary school-based nurseries • Free breakfast clubs in every primary school • A modern curriculum so young people are ready for work and life • High-quality apprenticeships and specialist technical colleges Zahida, Trust School Improvement Partner \"I went into education to make a difference for all children, especially those from council estates like the one I grew up on\" Labour will transform our education system so that young people get the opportunities they deserve. We will expand our childcare and early-years system, drive up standards, modernise the school curriculum, reform assessment, and create higher-quality training and employment paths. Every child should believe that success belongs to them. It is time to light that fire for the whole country. Family security. The next Labour government will build on that legacy of pursuing opportunity and social justice. Labour will legislate where the Conservatives have failed. We will abolish Section 21 ‘no fault’ evictions, prevent private renters being exploited and discriminated against, empower them to challenge unreasonable rent increases, and take steps to decisively raise standards. Labour is determined to raise school standards for every child, and ensure they are prepared for the future. Most children attend schools where the Conservatives are failing to provide the support and teaching that they need. Labour will end VAT exemption and business rates relief for private schools to invest in our state schools. Labour will launch an expert-led review of curriculum and assessment. Our reforms will build on the hard work of teachers who have brought subjects alive with knowledge-rich syllabuses. Too often our education and care systems do not meet the needs of all children. Skills England will bring together business, training providers and unions with national and local government to ensure we have the highly trained workforce needed to deliver Labour’s Industrial Strategy. We are committed to devolving adult skills funding to Combined Authorities, empowering local leaders to have greater control of skills development in their areas. Labour will also reform the Conservatives’ broken Apprenticeships Levy. We will work constructively with the BBC and other public service broadcasters. We will get more children active by protecting time for physical education. Labour will improve access to cultural assets by requiring public museums and galleries to increase the loans they make from their collections to communities across the country.",
    "LibDem": "Liberal Democrats believe education is the best investment we can make in our children’s potential and our country’s future. We will invest in education, starting in the crucial early years and continuing throughout adulthood. We want every child to get the support and attention they need at school, so they leave with the skills, confidence and resilience to be happy and successful – whatever they choose to do next. This will draw on best practice such as the International Baccalaureate. Improve the quality of vocational education, including skills for entrepreneurship and self-employment. Expand provision of extracurricular activities, such as sport, music, drama, debating and coding. • Introducing a statutory Student Mental Health Charter and requiring universities to make mental health services accessible to their students. • Returning to the Erasmus Plus programme as an associated country, as set out in chapter 9.",
    "PlaidCymru": "Education holds the key to Wales’s future, and Plaid Cymru wants to create an education system where both learners and the workforce can thrive. Fairness for Parents. No child or family should struggle with the cost of education. We will continue to campaign for universal free schools meals to be extended to secondary school learners, in years 7 to 11, ensuring all children attending school receive a nutritious meal every day. Learners are also affected by the costs of the school day, including transport, uniforms and extra-curricular activities  Reviewing the implementation of the new Curriculum for Wales and the Additional Learning Needs Act is essential. This also means providing training and resources to the workforce. There is no reason why private fee-paying schools should receive additional support from taxpayers. We would scrap private school charitable status and charge VAT on fees and remove the exemption from business rates. Plaid Cymru will review the Seren programme, which aims to support Wales’s brightest sixth-formers. We will offer summer schools at each Welsh university for Seren Foundation learners, expand the current partnerships with Aberystwyth and Cardiff universities and set up new pilots in other Welsh institutions. Higher Education and Research. We recognise the important role of universities within our communities, in attracting students and staff. Tuition and maintenance loans at Levels 4, 5 and 6 will be made available to all adults aged 18 or over, and available in both further and higher education. We would address the fall in part-time and mature study over the past decade. This may include more blended learning options and a move away from three-year full-time bachelor’s degrees.",
    "Reform": "Reform UK will ensure those who can work do work. Lifting the Income Tax start point to £20,000 per year means an extra £1,500 per year. Employment is critical to improving mental health. Enforce a 2-Strike Rule for Job Offers All job seekers and those fit to work must find employment within 4 months or accept a job after 2 offers. Otherwise, benefits are withdrawn. Those registered with severe disabilities or serious long-term illnesses would be exempt from regular checks.",
    "SDLP": "The SDLP was vocal throughout the Independent Review of Education. We have expressed our concerns that without significant additional resources, the review will end up being a paper exercise. Working alongside the SDLP Opposition at Stormont, SDLP MPs will: Fair pay for teachers and school staff. Support for the Irish Language Sector, including ensuring that Irish-medium education is fully supported. Action on restraint and seclusion - Statutory guidance and appropriate training for school staff and governors about the use of restrictive practices in an educational setting. The SDLP Opposition has led the way in opposing the decision to remove £150 million of ringfenced funding by the Executive and UK Government. We supported the recent Integrated Education Act and will continue to promote integrated education.",
    "SinnFein": "Sinn Féin has consistently challenged the British Government’s under-funding of our public services. We are also committed to delivering the flagship projects committed to by the Executive such as the Magee University expansion.",
    "SNP": "Westminster’s cuts to capital funding have disrupted longer term investment. In the UK Spring Budget, the Tories cut capital yet again. This time by almost 9% – or a cumulative loss of £1.3bn by 2027/28. Brexit has been a disaster for Scotland. Brexit has wiped billions of pounds from the Scottish economy, pushed up prices on food and services and hit hard our ability to fund vital public",
    "TUV": "TUV sees tackling educational underachievement as its number one priority. To address this inequality, we propose: An evidence-informed curriculum overhaul. We propose: Investment in teacher recruitment and fair teacher pay. TUV believes in a fair deal for classroom assistants including greater job",
    "UUP": "The Ulster Unionist Party believes that the future of Northern Ireland lies in the strength and potential of our children and young people. We will establish a single education system that: Values every child equally, providing tailored support and resources to meet individual needs. Integrates children of all abilities, fostering a culture of inclusivity and mutual respect. Promotes early support and intervention, recognizing that early education and childcare are crucial for the holistic development of children and the well-being of families. The Ulster Unionist Party envisions an education system where every child and young person can thrive and reach their full potential. We will work tirelessly to secure funding and implement the policies necessary to make this vision a reality. Together, we can create a world-class education system that is a source of pride for Northern Ireland."
}