{
    "Alliance": "A Green New Deal recognises that tackling the climate crisis goes hand in hand with economic transformation and social justice. It’s about urgently decarbonising our economy, and in doing so, unlocking a fairer, more resilient economy filled with clean, affordable, renewable energy. Extreme weather changes will only continue to accelerate, causing needless financial distress for households, businesses and public services if we don’t future-proof our infrastructure. Reforming wealth taxes on the super-rich has been estimated to generate up to £50 billion annually. Alliance MPs will work in close collaboration with Northern Ireland’s Minister for Agriculture, Environment and Rural Affairs. Ensuring Northern Ireland receives its fair share of funding raised under the UK’s Emissions Trading Scheme. • Scrutinising every UK-wide energy package to ensure it prioritises renewable energy. Introducing UK air quality limits in line with World Health Organisation levels to guarantee and monitor the right to breathe clean air both indoors and outdoors.",
    "Conservative": "In the last few years, we have faced the greatest shock to our energy security since the 1970s. Britain had little reliance on Russian fuel when the invasion began. But when global energy prices spiked, the Government stepped in to pay half the typical household bill at the peak, saving families £1,500 on average. Bills are now coming down and in July will fall to the lowest level in over two years. In the next Parliament we will:  Treble our ofshore wind capacity, to deliver low-cost, home-grown energy and support the development of vibrant industrial clusters in places like the North East of England, Scotland and Wales.  Build the frst two carbon capture and storage clusters, based across North Wales and the North West of England and Teesside and the Humber, cutting carbon and creating tens of thousands of jobs in these regions. We will halve the time it takes for new nuclear We agreed a £500 million grant as part of a £1.25 billion commitment by Tata Steel to transform and secure a sustainable future at their Port Talbot works. We will implement a new import carbon pricing mechanism by 2027 to ensure that imports of iron, steel, aluminium, ceramics and cement from countries with a lower or no carbon price will face a comparable carbon price to those goods produced in the UK. This will reduce the risk of industry being displaced to other countries which aren’t taking Energy bills are falling, down 63% since peak peak. We will take further action to ensure they are low as possible for families. As energy market advances, price cap will need to evolve. Introducing more efcient local markets for electricity.",
    "DUP": "Northern Ireland is fast emerging as an innovator in hydrogen technology. Companies such as Wrightbus are developing cutting-edge technologies which are revolutionising whole sectors. Indeed, it could in time meet approximately one-third of local energy needs. The DUP has consulted key stakeholders to develop a Hydrogen Growth Strategy. A national approach to co-design, delivery and monitoring of climate policy will be crucial in the next Parliament, as will ensuring there is an approach to enforcement that provides a level playing field across the United Kingdom. The DUP supports the decision to push back a ban on new petrol and diesel vehicles to at least 2035.",
    "Green": "Green MPs will push the next government to stop all new fossil fuel extraction projects in the United Kingdom and to cancel recently issued fossil fuel licences. We will also end all subsidies to the oil and gas industries. The tax would be proportional to the greenhouse gas emissions produced when fuel is burnt. We need to learn lessons from the 1980s when coal mining and other heavy industries were shut down. We will push the next government to establish an Offshore Energy and Skills Passport. Elected Greens will push for: • Investment in skills and training (including retrofitting) reaching £4bn per year, allowing workers to be prepared for the transition. The Crown Estate will be brought into public ownership and should open more coastal waters for offshore wind and marine energy. Control over its assets within the jurisdiction of Wales should be devolved to the Welsh Government, as it is in Scotland. Elected Greens will seek to properly regulate biofuels to end greenwashing and ensure they provide genuine net carbon savings. We would end the practice of importing wood for burning at the Drax power station and end subsidies for biomass. Green MPs will campaign to phase out existing nuclear power stations. Our country is one of the richest in the world, yet millions of people are struggling to put food on the table and pay their bills. The government has failed to invest in rapidly transitioning to a zero-carbon society, to create decent, secure jobs or to make our economy resilient to future climate shocks. Green MPs will increase investment into research and development by over £30bn across five years. Bringing privatised utilities back into public ownership. Privateisation has failed. Dividends are paid to shareholders while infrastructure is run into the ground. Public investment would buy equity in these public utilities.",
    "Labour": "Clean energy by 2030 is Labour’s second mission. The clean energy transition represents a huge opportunity to generate growth, tackle the cost-of-living crisis and make Britain energy independent once again. Labour will take decisive action to seize this economic opportunity. At the heart of our approach will be our Green Prosperity Plan. Our plan will create 650,000 jobs across the country by 2030. The Conservatives propose an alternative course. New nuclear power stations, such as Sizewell C, and Small Modular Reactors, will play an important role in helping the UK achieve energy security and clean power while securing thousands of good, skilled jobs. Labour will maintain a strategic reserve of gas power stations to guarantee security of supply. We will embrace the future of energy production and storage which will make use of existing offshore infrastructure. Labour will capitalise Great British Energy with £8.3 billion over next parliament. The company will create jobs and build supply chains in every corner of the UK. Scotland will be the powerhouse of our clean energy mission. We will review unfair surplus arrangements and transfer the Investment Reserve Fund back to members, so that the mineworkers who powered our country receive a fairer pension. Labour will invest an extra £6.6 billion over the next parliament, doubling the existing planned government investment, to upgrade five million homes to cut bills for families. The Warm Homes Plan will offer grants and low interest loans to support investment in insulation and other improvements such as solar panels, batteries and low carbon heating. We will also work with the private sector, including banks and building societies, The Conservatives’ poor risk management and disjointed approach have left Britain badly exposed. Labour will improve resilience across central government, local authorities, local communities, and emergency services. This includes formally working with all stakeholders in the Fire and Rescue services to inform policy and establish national standards. Protecting nature. The climate crisis has accelerated the nature crisis.",
    "LibDem": "Climate Change and Energy is an existential threat. Soaring temperatures leading to wildfires, floods, droughts and rising sea levels are affecting millions of people directly. At the same time, sky-high energy bills are hurting families and businesses. The Conservative Government has failed to act with anything close to the speed or ambition these challenges demand. • Putting tackling climate change at the heart of a new industrial strategy, as set out in chapter 4 and 8. • Investing in education and training to equip people with the skills needed for the low-carbon economy of the future. • Making it cheaper and easier to switch to electric vehicles, restoring the requirement that every new car and small van sold from 2030 is zero- emission, investing in active travel and public transport. Building grid infrastructure required, facilitated by strategic Land and Sea Use Framework. Implementing UK’s G7 pledge to end fossil fuel subsidies. Investing in energy storage, including green hydrogen, pumped storage and battery capability. Regulating financial services to encourage climate-friendly investments, including requiring pension funds and managers to show that their portfolio investments are consistent with the Paris Agreement. Support British industry to cut emissions by: • Setting out a clear and stable roadmap to net zero, repairing the damage done by Conservative U-turns and giving businesses the confidence to invest. • Implementing the Carbon Border Adjustment Mechanism for high-emission products. • Pass a Clean Air Act, based on World Health Organization guidelines, enforced by a new Air Quality Agency. • Strengthen the Office for Environmental Protection and provide more funding to the Environment Agency and Natural England to help protect our environment and enforce environmental laws. Ensuring new developments result in significant net gain for biodiversity. Empowering Local Nature Recovery Strategies to identify a new Wild Belt for nature’s recovery. • Create a nature-positive economy, tackle plastic pollution and waste, and get Britain recycling by introducing a deposit return scheme.",
    "PlaidCymru": "Plaid Cymru recognises that the climate and nature emergencies are the biggest threat to mankind on a global scale. It reaffirms our commitment to reaching net- zero targets in Wales by 2035 and reversing biodiversity decline by 2030. This requires collaboration and planning to achieve a just transition. This includes the use of Welsh local supply chains in future contracts for renewable energy developments of the Welsh Crown Estate, developing and supporting our local industries. This will become a Sovereign Wealth Fund for Wales, so that we invest the profits in our future generations. Control of water in Wales would allow the Senedd to set higher environmental targets on water quality and lower prices, where possible. Plaid Cymru opposes the development of new sites for nuclear power stations. The legacy of coal mining continues to leave scars on our nation's landscape. Westminster benefited from the mining industry in the days before devolution. Plaid Cymru is the first parliament in the UK to declare a nature emergency. The loss of biodiversity and species will affect us all – and 1 in every 6 species in Wales is already threatened with extinction. We support a science-led plan aligned with the Kunming-Montreal agreement.",
    "Reform": "Scrap Net Zero could save the public sector over £30 billion per year for the next 25 years. Scrap Annual £10 Billion of Renewable Energy Subsidies Achieve this through equivalent taxes on them. Our bills have increased dramatically in line with the huge increase in renewables capacity over the last 15 years. Cheap, Secure Energy for Britain Start fast-track licences of North Sea gas and oil. Grant shale gas licences on test sites for 2 years. Enable major production when safety is proven, with local compensation schemes \"Reform UK will scrap Net Zero to cut bills and restore growth\" NET ZE",
    "SDLP": "SDLP MPs will always support ambitious climate legislation at Westminster. In the last mandate, we supported the Climate & Nature Bill. This would be aimed at rapidly reducing greenhouse gas emissions. We will also support a ‘Well-being of Future Generations Bill’. The SDLP will insist that a newly established Independent Environmental Protection Agency prioritises improvement in the status of our rivers, lakes, transitional & coastal water bodies. Steps must be taken to upgrade the Wastewater Treatment Works around Lough Neagh, introduce unannounced sampling of water, enforce existing regulation on pollution with fines when necessary, and increase inspections of farms. SDLP MPs will continue to lobby the next government on this issue in order to end the scandal of animal abuse across these islands. Support new legislation on clean air Poor air quality contributes to 800 deaths in Northern Ireland every year.",
    "SinnFein": "We want to increase productivity and opportunities for skills and training and meet climate change targets through a fair and just transition to net zero. There is now a real opportunity to shape a more prosperous future in a stronger, better and fairer country. An opportunity to create an efficient all-Ireland national health service, a sustainable housing system, affordable childcare.",
    "SNP": "Scotland is an energy-rich nation but without full powers of independence we cannot fully harness the opportunities our vast renewable energy sources provide. We will demand the devolution of powers over energy regulation, pricing and production to ensure that our natural energy resources are used to best serve the needs of the Scottish people. Scotland as a whole should see far more of that benefit, but local communities who house the infrastructure – like pylons and wind farms – should get a much greater degree of benefit. The UK Government is the decision-maker on new oil and gas licences. We believe any further extraction must be consistent with our climate obligations. Support the North East and the Just Transition. The future of the Grangemouth complex must be secured and a just transition delivered for the workforce. Establish a Four Nations Climate Response Group to agree climate plans across the UK that deliver on our net-zero targets. Devolve powers to create a bespoke migration system for Scotland. Scotland should have full powers over immigration, including the devolution of overseas workers’ employment visas. Introduce a rural visa pilot scheme. SNP MPs will call for the UK Government to: Transfer full powers for complete integration of track and train to Scotland. The UK Government must also fully support the production and use of sustainable bridging fuels in the maritime and aviation sectors. Strengthen incentives to purchase cleaner vehicles.",
    "TUV": "Food production and farming is an integrated £5 billion industry in Northern Ireland. The centrality of our farming and food sector to Northern Ireland’s economy means its future must not be jeopardised by pursuit of an anti-farming ideology associated with climate change activists. TUV was clear and determined in opposing this disastrous Bill and will continue to protect farming interests.",
    "UUP": "The Ulster Unionist Party recognises the vital role that agriculture, food production, and our rural communities play in the economic and social fabric of Northern Ireland and the United Kingdom as a whole. The agri-food sector contributes over £5 billion to the Northern Ireland economy annually and employing over 100,000 people. From our world-renowned dairy products and beef, our skill and innovation of our farmers and food producers is a source of immense pride. Ulster Unionist Party is committed to ensuring that Northern Ireland makes a fair contribution to the goal of UK Net Zero. As part of this commitment, we support the UK's Ten Point Plan for a Green Industrial Revolution. The scale and technological advancements required to achieve these goals necessitate Northern Ireland's continued partnership within the United Kingdom. Ulster Unionists will continue to press NI Water for an urgent assessment of the proximity to a critical tipping point where Lough Neagh water may become unusable for drinking. The long absence of an Executive at Stormont has exacerbated these challenges. All stakeholders must engage in proactive dialogue and action to address this pressing environmental crisis before irreversible damage occurs."
}