{
    "Alliance": "IMPACT ON PUBLIC SERVICES, ECONOMY AND CLIMATE. Without reform, public services will continue to decline and decay at the expense of societal well-being, and our economic and environmental future. The UK economy continues to underperform. Brexit has caused further challenges, and the additional resultant trade barriers to the UK’s largest market have hindered growth significantly. Alliance will work to secure a base-lined fiscal floor, set above 124. We do not believe the UK Government’s figure captures our relative need. There is much more we can do with the money we have to ensure quality public services for people in NI.",
    "Conservative": "Since 2010, we have invested more in the NHS than at any other point in its history. We will continue to increase NHS spending above infation in each year of the next Parliament. Through the pandemic, the Conservative Government acted to save lives, protect the NHS and deliver a world leading vaccine programme. We will modernise NHS primary care services and bring health and care closer to patients. Our Dental Recovery Plan will unlock 2.5 million more NHS dental appointments. We will make further reforms to the dental contract to ensure its future sustainability. Rural and coastal communities will be better served through ‘golden hellos’. We will eliminate bureaucratic obstacles to the use of new medicines. We will align NHS England’s cost-efectiveness thresholds for new medicines indications with those used by NICE. Our new medtech pathway will reduce waste and bureaucracy in the NHS. We will complete the implementation of the Cass Review. We will protect young people questioning their gender from ideologically- driven care and ensuring that NHS services follow evidence-based best practice. We will also give a further £210,000 interim payment to living infected benefciaries. Inquiry’s wide-ranging recommendations and provide a full response to the inquiry.",
    "DUP": "The DUP is unashamedly pro-life and continues to oppose the radical abortion laws. Since 2019, DUP MPs have: opposed the commissioning of abortion services in Northern Ireland and legal instruction from the Government to ringfence funding for this from the block grant. DUP MPs will support a wide-ranging audit of central and local government facilities to ensure they are accessible to those with disabilities. Work with the Inclusive Mobility and Transport Advisory Committee (IMTAC) in future transport projects. Encourage government departments, public bodies and local authorities across the UK to join Access Able. DUP MPs will campaign to drive waiting lists down. Fostering large-scale partnerships between health and social care in NI and national independent providers or not-for-profit organisations.",
    "Green": "The NHS is facing the most serious crisis in its 80-year history. Our most precious national institution is at serious risk, with patients dying in ambulances, record waiting lists for surgery, and cancer survival rates amongst the worst in higher-income countries. Elected Greens would choose to treat and pay nurses, doctors and NHS staff fairly, so we don’t lose them overseas. We would increase taxes on the super-rich to fund our national health service properly. Green MPs will back the NHS Reinstatement Bill to Building a Fairer, Healthier Country abolish wasteful competition within the NHS. This blueprint is designed to reverse the damage caused by previous governments that pursued an agenda that the market could make the NHS better. By contrast, Greens will always stand against the marketisation and privatisation of our precious health service and will choose instead to protect our NHS and keep it in public hands. Additional investment in NHS dentistry, reaching £3bn a year by 2030, would transform the availability of appointments. Elected Greens will campaign for funding to allow community hubs and primary care to provide a roll-out of free dental nursing for children and those on low incomes. This model would deliver preventative work and make referrals into NHS care pathways following oral health checks. We will ensure that tailored and specific provision is readily available for the particular needs of communities of colour, children and adolescents, older people and Lesbian, Gay Bisexual, Trans, Intersex, Queer and Asexual (LGBTIQA+) communities. The investment in primary care set out above will create easier access to these services in all communities, including in the school system. We will provide a trained and paid counsellor in every primary and secondary school, and every sixth-form college. This work will be supported through bur Elected Greens will bring together local authorities, trade unions and private providers to establish a career structure for carers. This would have national pay, terms and conditions for all care workers and a proper workforce plan. Elected greens will also change the working visa system to end the exploitation of overseas workers in the care sector. It would ensure that carers are free to change employer in the UK.",
    "Labour": "NHS will return to meeting NHS performance standards. Patients should expect to wait no longer than 18 weeks from referral for consultant-led treatment of non-urgent health conditions. This standard was achieved with the last Labour government. As part of Labour’s life sciences plan, we will develop an NHS innovation and adoption strategy in England. This will include a plan for procurement, giving a clearer route to get products into the NHS coupled with reformed incentive structures to drive innovation. Drawing on the strength of our National Health Service, Labour will also maximise our potential to lead the world in clinical trials. This means putting Britain at the forefront of transforming treatment for dementia. To achieve this, we must over time shift resources to primary care and community services. We will train thousands more GPs, guarantee a face-to-face appointment for all those who want one and deliver a modern appointment booking system to end the 8am scramble. Labour will also take the pressure off GP surgeries by improving access to services and treatment through new routes. Services will be locally delivered, with a principle of ‘home first’ that supports people to live independently for as long as possible. We will enhance partnership working across employers, workers, trade unions and government and establish a Fair Pay Agreement in adult social care. This sector collective agreement will set fair pay, terms and conditions, along with training standards. Labour is committed to ensuring families have the support they need. Labour will ban vapes from being branded and advertised to appeal to children to stop the next generation from becoming hooked on nicotine. We face a childhood obesity crisis. So, Labour is committed to banning advertising junk food to children and the sale of high-caffeine energy drinks to under-16s. Children and young people face significant harm online, with inappropriate content too easily available at their fingertips on a smartphone.",
    "LibDem": "Conservatives have plunged the NHS into crisis – as have the SNP in Scotland and Labour in Wales. With more than a hundred thousand staff vacancies in England alone, a crisis in staff retention, long waiting times, missed targets and poor outcomes, patient safety is being pushed into the danger zone. People are no longer confident that when they ring 999 an ambulance will turn up in time. Liberal Democrats believe that people should be in control of their own lives and health and that means everyone should get the care they need • Boost cancer survival rates and introduce a guarantee for 100% of patients to start treatment for cancer within 62 days from urgent referral. • Give everyone the right to see a GP or the most appropriate practice staff member within seven days, or within 24 hours if they urgently need to, by: • Increasing the number of full-time equivalent GPs by 8,000, half by boosting recruitment. Introducing a universal 24/7 GP booking system. • Removing top-down bureaucracy to let Making prescriptions for people with chronic mental health conditions free on the NHS. Transforming perinatal mental health support for those who are pregnant, new mothers and those who have experienced miscarriage or stillbirth. Cutting suicide rates with a focus on community suicide prevention services and improving prevention training for frontline NHS staff. • Introducing a new levy on tobacco company profits to help fund healthcare and smoking cessation services. • Protecting children from exposure to junk food by supporting local authorities to restrict outdoor advertising and restricting TV advertising to post-watershed. • Ring-fencing budgets to enable the NHS to adopt innovative digital tools that improve patient care and experience and save staff time and costs. • Replacing old, slow computers to free up clinicians’ time to care for patients. • Ensuring every care setting has electronic records that feed into a patient’s health record with the patient's consent. We will forge a new consensus on funding to ensure no one has to sell their home to pay for their personal care. We will invest to save, recognising that providing care reduces demand on more expensive NHS services. • Create a social care workforce plan, establish a Royal College of Care Workers to improve recognition and career progression, and introduce a higher Carer’s Minimum Wage. • Introducing a Young Carers Pupil Premium as part of an ‘Education Guarantee’ for young carers. • Creating a new Carer’s Minimum Wage, boosting the minimum wage for care workers by £2 an hour. Creating clear career pathways, linked to recommended pay scales, which put an end to undervaluing of skills in the sector.",
    "PlaidCymru": "Plaid Cymru strongly believes in the principle of healthcare free at the point of delivery, funded through general taxation. We oppose the privatisation of services by stealth through out-sourcing, and will work to ensure that our NHS is properly funded through a new fairer and needs-based funding model for Wales. We stand in solidarity with doctors, nurses and other healthcare professionals who are undertaking industrial action on pay and wage restoration. We believe that wage restoration pledges for NHS staff must be implemented as soon as possible. Plaid Cymru believes that we should move public health towards becoming a wellness service geared towards keeping people healthy. A preventative public health strategy which rebalances resources to prevent people becoming ill would help the NHS overall by stopping patients entering the system earlier than necessary. Ending this distinction will also help reduce Delayed Transfers of Care. We support John’s Campaign for the right of people to be supported by their family carers. Plaid Cymru is committed to the consultation on the elimination of profit in children’s services provision. Plaid Cymru’s cancer contract, a Stop Cancer Strategy, would ensure no downgrading of suspected cancer referrals, lower the sensitivity threshold for bowel cancer screening and increase rates of lung cancer screening. We would invest in the workforce to recruit, train and retain more oncology staff. We will support the creation of a national register of Barrett’s oesophagus in Wales. Mental Health. We support reform of the Mental Health Act.",
    "Reform": "CRITICAL REFORMS NEEDED IN THE FIRST 100 DAYS: End Doctor and Nurse Shortages. All frontline NHS and social care staff to pay zero basic rate tax for 3 years. This will help retain existing staff and attract many who have left to return. Write off student fees pro rata per year over 10 years of NHS service for all doctors, nurses and medical staff. The NHS Needs Urgent Reform “Patients first. Rapid care. Cutting waste - an NHS to be proud of again” NHS PLEDGES COSTS = £17 BILLION PA. Net Zero is pushing up bills, damaging British industries like steel, and making us less secure. Reform UK will ensure that our elderly people can live with dignity through long-term reforms funded by a growing economy. \"",
    "SDLP": "Over half a million people are currently waiting for an appointment - more than 1 in 4 of our entire population. Over half of those people are likely to wait for more than a year on a first outpatient session. The North’s Health Service needs a Marshall Plan style intervention. Working alongside the SDLP Opposition at Stormont, SDLP MPs will: Make representation directly to the Treasury for a health service transformation intervention. Argue for terms and conditions for health service staff which reflect their contribution to our society. Fight for the expansion of Multi-Disciplinary Teams across Northern Ireland.",
    "SinnFein": "Sinn Féin has consistently challenged the British Government’s under-funding of our public services. We want to see multi-annual budgeting so that the Executive is better equipped to plan and make longer term investments such as tackling hospital waiting lists. There is now a real opportunity to shape a more prosperous future in a stronger, better and fairer country.",
    "SNP": "SNP MPs will demand the UK Government: Protect the NHS from Westminster privatisation through our ‘Keep the NHS in Public Hands’ Bill. Further privatisation must be ruled out and the new UK Government should commit to back our Bill, ensuring the health service is fully protected as a publicly owned and operated service. The Bill will stop any UK government undermining the principles and protections of the NHS as part of any future trade deals. Match Scotland’s NHS pay deals by increasing investment in NHS England staff pay and conditions Scotland could unleash its full potential and build a better, fairer society. With independence we can guarantee the rights of working people in Scotland are protected and strengthened. SNP MPs will demand the next UK Government stand with workers and repeal the Strikes (Minimum Services Levels) Act. We stand firmly against this abhorrent policy and will continue to call for its abolition. Scrap proposed punitive welfare reforms for sick and disabled people. Protect pensions by maintaining the triple lock and move to deliver a wellbeing pension. We would decriminalise drugs for personal use and introduce framework to allow Supervised Drug Consumption Facilities. Treat problem gambling as a public health matter and take action to tackle the impacts of advertising. Introduce a RAAC Remediation Fund to ensure new capital money is made available. Deliver justice for Post Office Horizon victims. Brexit has been a disaster for Scotland. We have been dragged out against our will. Brexit has wiped billions of pounds from the Scottish economy.",
    "TUV": "This year’s budget passed by Stormont was down by 2.3% compared to what was actually spent by the end of last year. The provision of a fully functioning and effective NHS is critical to us all. We do not need more deputy directors; we need more doctors and nurses. TUV is opposed to the closure of minor injuries units which will only increase pressures on hospital A & Es. TUV supports increased funding for Community Mental Health services. We believe there is a need for adequate acute psychiatric beds. No patient should be forced to travel outside their Trust area. Strenuous efforts are now required to make up the lost ground. TUV, being unashamedly pro-life, opposes such demands by Sinn Fein and Alliance MLAs.",
    "UUP": "Ulster Unionist Party took the courageous decision to return to the Department of Health. Despite being the only single-Minister Party within the Executive, we again demonstrated a genuine obligation by returning to the most difficult job in the Northern Ireland Executive. Ulster Unionist Party’s focus will remain on driving through improvements in service delivery wherever and whenever possible. This will include the identification of the next Elective Overnight Stay Centre as well as further commissioned activity in Day Procedure Centres. A new targeted and innovative health inequalities initiative will be announced in the autumn. The Ulster Unionist Party is committed to supporting gender equality. We will work to remove barriers to women's participation in employment by providing accessible, affordable childcare and access to education, training, and transport. We support flexible working and parental leave for both parents and making progress towards gender-responsive budgeting, providing financial guidance and support as women approach retirement age. In Northern Ireland, approximately 21% of the population reported having a disability according to the most recent surveys, a figure that mirrors trends across other regions of the UK. Ulster Unionist Party MPs will advocate for the next Government to acknowledge the high proportion of population living with disabilities. This will include pressing for the incorporation of the United Nations Convention on the Rights of Persons with Disabilities into UK law."
}