{
    "Alliance": "UK Net Zero Carbon Buildings Standard supports emergency programme to reduce energy consumption from all buildings. End use of hotels and privatisation of accommodation for those seeking asylum. Make providers of asylum accommodation subject to statutory duty to refer people leaving asylum support accommodation who are at risk of homelessness to local housing authority.",
    "Conservative": "We have delivered 2.5 million homes since 2010 including meeting our commitment to deliver one million homes in the last Parliament. Home ownership rates plummeted under the last Labour Government so we cannot aford to go back to square one. We will deliver 1.6 million houses in England in the next Parliament by:  Abolishing the legacy EU ‘nutrient neutrality’ rules to immediately unlock the building of 100,000 new homes. Our national planning protections mean there is never any top-down requirement for councils to remove Green Belt protection and these will remain in place. We will ensure the majority of frst-time buyers pay Stamp Duty to £425,000 from £300,000 which we introduced in 2022. We will pass a Renters Reform Bill that will deliver fairness in the rental market for landlords and renters alike. We will continue with our plans to end rough sleeping and prevent people from ending up on the streets in the frst place.",
    "DUP": "DUP MPs will fight to ensure national immigration and asylum policy applies equally across the United Kingdom by restoring Parliamentary sovereignty over the law in Northern Ireland. Support an approach that allows those fleeing war or persecution to find refuge in the UK. There are clear synergies between the All-Island Rail Review and the Union Connectivity Review.",
    "Green": "Elected Greens will push for an additional £3bn to be provided to local authorities to enable them to provide high-quality children’s social care. We would fund councils to extend staying put arrangements so fostered young people can choose to stay with foster parents until they are 21. There are over a million households on council waiting lists. Over 130,000 children are growing up in temporary accommodation. Elected Greens will campaign to change building regulations so all new homes meet Passivhaus or equivalent standards. We will upgrade the Minimum Energy Efficiency Standard to EPC C. Our Fairer, Greener Homes Guarantee. Most people’s energy bills are unnecessarily high because the UK has the worst insulated homes in Europe. We will push for tenants to have the right to insist landlords access property-linked finance on their behalf. Landlords will not need to provide any up-front finance, but they would have to repay the debt and will benefit from the improved value of the property. Rent controls would prevent them passing repayments straight on to tenants. We will end the ‘right to buy’ so that homes continue to belong to communities who funded them. Elected Greens will introduce legislation to give local authorities, registered social landlords and community housing groups the first option to buy certain properties at reasonable rates. Local authorities need to be given the resources to act as guardians of the land and the built environment. Greens wants communities to have the funding and the powers to make the planning decisions that are right for them. Elected Greens know we can ensure secure energy and affordable bills. We can move over to a range of renewable energy technologies, from wind to solar. Making our homes more energy efficient is crucial to reducing the cost of energy for everyone.",
    "Labour": "Labour will require all Combined and Mayoral Authorities to strategically plan for housing growth in their areas. We will give Combined Authorities new planning powers along with new freedoms and flexibilities to make better use of grant funding. Labour will further reform compulsory purchase compensation rules to improve land assembly and speed up site delivery. Labour will invest an extra £6.6 billion over the next parliament, doubling the existing planned government investment, to upgrade five million homes to cut bills for families. The Warm Homes Plan will offer grants and low interest loans to support investment in insulation and other improvements such as solar panels, batteries and low carbon heating. We will also work with the private sector, including banks and building societies, to provide further private finance.",
    "LibDem": "Too many people live in housing so poor it damages their health. Government housebuilding targets are regularly missed and the shortage of affordable and social housing is at crisis point. Too many new houses are built as leasehold and leaseholders still face large bills. Liberal Democrats are committed to tackling housing failures head-on. Properly funding local planning departments to improve planning outcomes. Encouraging development of existing brownfield sites with financial incentives. Introducing ‘use-it-or-lose-it’ planning permission for developers who refuse to build. Introducing a ‘somewhere safe to stay’ legal duty to ensure everyone who is at risk of sleeping rough is provided with emergency accommodation and an assessment of their needs. • Ensuring sufficient financial resources for local authorities to deliver the Homelessness Reduction Act and provide accommodation for survivors of domestic abuse.",
    "PlaidCymru": "Wales needs to ensure that the supply of housing meets community needs. This requires a significant expansion in the amount of social and municipal housing stock. Plaid Cymru campaigned to end the Housing Revenue Account Subsidy Scheme. As result, eleven local authorities now have the opportunity to build their own council housing once again. Plaid Cymru’s campaigning has helped increase council tax premiums on empty properties. There is no good reason why so many properties are left empty when they could be housing individuals and families. We believe that everybody has the right to live within the community in which they were raised. Cold Weather Payments are made when the temperature dips below freezing for seven days. However, the measuring stations in Wales are often near coastal areas which may be warmer than surrounding mountainous areas, thereby reducing those populations payment eligibility. Universal Basic Income Pilots Plaid Cymru support the principle of a universal basic income.",
    "Reform": "Reform UK will ensure that people can own their own home. Fast-track planning and tax incentives for development of brownfield sites. Reform Social Housing Law Prioritise local people and those who have paid into the system. Scrap section 24 for Landlords The tax system should encourage smaller landlords into the rental markets. Not penalise them. Britain has a Housing Crisis. “Affordable homes for hard-working British people.” HOUSING PLEDGES COSTS = £ NEUTRAL.",
    "SDLP": "The SDLP will also hold the Minister for Communities responsible for the failure to build the appropriate level of housing, including social homes. The costs of rent and mortgages have forced more and more people into poverty in recent years.",
    "SinnFein": "Sinn Féin is committed to delivering on the things that matter most to workers and families: healthcare, the cost of living, housing, education, childcare.",
    "SNP": "To relieve the immediate pressure on households, SNP MPs at Westminster will: Demand an essentials guarantee, ensuring that, at a minimum, everyone can afford basic necessities like food and utilities. Push for an annual uplift of Local Housing Allowance whilst ensuring rental costs are taken into account. Reintroduce a simplified Help to Buy ISA scheme to help first time buyers. Scrap the cruel bedroom tax which punishes people claiming Universal Credit or housing benefit if they have a spare room in their rented council or housing association home. Devolve Housing Benefit and Local Housing Allowance which will allow the Scottish Government to take an innovative approach to tackle child poverty, expand the delivery of social housing and to help fund and encourage investment in house building.",
    "TUV": "TUV proposes a policy of one house down and at least one house up in urban areas. The change wrought by an open border policy with the EU has left a legacy of issues.",
    "UUP": "The housing crisis is a multi-faceted issue, impacting various aspects of life. It is imperative that all regions of the UK, including Northern Ireland, unite in their efforts to develop and implement comprehensive housing strategies to tackle this crisis."
}