{
    "Alliance": "Alliance believes in a shared and united community. That means representing everyone in Northern Ireland. It enriches our culture, opens our minds, causes love and families to grow, and significantly improves our economy. Conservative Party has used Brexit as a vehicle to introduce an increasingly punitive, cynical immigration system. The annual number of asylum applications to the UK peaked in 2002. The UK therefore takes a tiny fraction of the world’s refugees. Most asylum seekers stay in the first country they feel safe. Around 85% of refugees globally live in developing regions. MPs will work to: • Restore universal right to seek asylum by repealing Illegal Migration Act 2023, Nationality and Borders Act 2022, Safety of Rwanda (Asylum and Immigration) Act 2024. • Establish safe, legal routes to claim asylum in the UK, expanding resettlement schemes and making it easier for vulnerable family members to be reunited. Alliance MP Stephen Farry secured an exemption for third-party non-visa nationals living on the island of Ireland from the UK’s Electronic Travel Authorisation (ETA) scheme. The Irish and UK Governments must work together to protect residents’ CTA rights and make a positive case for immigration.",
    "Conservative": "Conservatives are the only party with a plan to stop the boats. Labour have no plan and would grant an amnesty to thousands of illegal migrants. Last year, small boat arrivals to the UK fell by a third. In addition to maintaining visa schemes for people feeing persecution, we will give parliament control of how many places we ofer on safe and legal routes. Delivering sustainable levels of high-skilled migration. We want to attract the brightest and best skilled migrants to the UK to contribute to our businesses and public services. We will give parliament an annual vote on the level of the cap so that the British people can have confidence that immigration numbers will be controlled. We have taken steps to ensure those coming to the UK do not place a burden on the NHS, by requiring them to pay the Immigration Health Surcharge.",
    "DUP": "DUP MPs will fight to ensure national immigration and asylum policy applies equally across the United Kingdom. The courts have ruled that Government’s policy on sending illegal migrants to Rwanda cannot extend to Northern Ireland because of Article 2 of the Protocol. That risks making Northern Ireland a magnet for asylum seekers seeking to escape enforcement. Direct Farm Support In the last term, the DUP team at Westminster secured a guarantee from the Government that the level of annual support provided for direct farm payments would be maintained at pre-2020 levels for the duration of the Parliament. DUP MPs will: 3 seek an increased, ring-fenced and multi- annual farm support and development budget. This must ensure that the annual level of funding provided by the Treasury is increased to match the impact of inflation.",
    "Green": "The Green Party acknowledges the right to claim asylum in any country. Elected Greens will campaign for a system of asylum and humanitarian protection. The United Kingdom will work with other countries to establish safe routes by which those fleeing persecution, war, or climate disaster may arrive in the country of their choice. Ending the hostile environment The hostile environment approach has not only been found at times to be unlawful, it has caused immense suffering for those caught up in it. Access to the NHS should be free and comprehensive for migrants with visas. Elected Greens will therefore push for migrants, including students, to be allowed to bring members of their family to the UK who would normally live with them in their country of origin. Our proposed significant increase to the overseas aid budget, as well as our policy of supporting lower-income countries to deal with the climate crisis, are vital to ensure people can stay in their home communities. We will also ensure that those who are forced to leave can do so safely and",
    "Labour": "We will reform the points-based immigration system so that it is fair and properly managed. Failure to do so reduces the incentives for businesses to train locally. Labour will bring joined-up thinking, ensuring migration triggers a plan to upskill workers and improve working conditions in the UK. We will devolve funding so local areas can shape a joined-up work, health, and skills offer for local people. We believe the Work Capability Assessment is not working and needs to be reformed or replaced, alongside a proper plan to support disabled people to work. One in eight young people are not in education, employment, or training. This new Command will work internationally and be supported by new counter-terrorism style powers. We will seek a new security agreement with the EU to ensure access to real-time intelligence. Labour will turn the page and restore order to the asylum system.",
    "LibDem": "The UK has a proud history of welcoming newcomers. People from all over the world have greatly enriched our economy. But our immigration system has been broken by the Conservatives. Their damaging new rules mean British employers can’t recruit the people they need. Replace Conservatives’ arbitrary salary threshold with a more flexible merit-based system for work visas. Exempt NHS and care staff from the £1,000-a-year Immigration Skills Charge. Expand Youth Mobility Scheme by: • Negotiating with the EU to extend it on a reciprocal basis. • Expand access to immigration legal advice by making the legal aid system simpler, fairer and more generous. • Establishing a new scheme to resettle unaccompanied child refugees from elsewhere in Europe. Reuniting unaccompanied children in Europe with family members in the UK.",
    "PlaidCymru": "Plaid Cymru strongly opposes the Conservative UK Government’s proposals and attitudes towards asylum seekers and refugees. We believe that the UK should uphold the commitments made when it signed up to the Refugee Treaty in 1951. Safe Routes. Effective management of the asylum process would allow processing to take place prior to reaching the UK, in a third country such as France. Conservative proposals to increase the skilled worker and family visa threshold and fee increases. We support the Migration Advisory Committees’ recommendation that the graduate route visa be retained.",
    "Reform": "Stop the Boats with our 4 Point Plan Leave the European Convention on Human Rights. Zero illegal immigrants to be resettled in the UK. New Department of Immigration. Pick up illegal migrants out of boats and take them back to France. Secure Detention for all Illegal Migrants All asylum seekers that arrive illegally from safe countries will be processed rapidly, offshore if necessary. No legal aid for non-citizens. Those rejected will be returned. Immediate Deportation for Foreign Criminals Deport foreign nationals Employer Immigration Tax The national Insurance rate will be raised to 20% for foreign workers. This would incentivise businesses to employ British citizens whose National Insurance rate would stay at 13.8%. Essential foreign health and care workers would be exempt from the tax.",
    "SDLP": "SDLP MPs will: Stand against hate crime and discrimination wherever it occurs. Transform our asylum system, including by repealing the anti-asylum seeker legislation introduced by the Conservative government. Advocate for the establishment of safe and legal routes for refugees to seek asylum Promote equal opportunities for integration into society including access to health, education, housing and fair employment for all in our community. Lobby to end the ban on asylum seekers working Ensure that asylum seekers are treated with the dignity they deserve and that they are given a fair and proper opportunity to apply for refugee status.",
    "SinnFein": "",
    "SNP": "Until then, it is vital the UK Government acknowledges the distinct demographic challenges we face in Scotland. Introduce a rural visa pilot scheme to mitigate against labour shortages. Mitigate the harm of Brexit on productivity by reviewing immigration rules.",
    "TUV": "Northern Ireland will become a magnet for illegal migrants, flooding into Northern Ireland to escape the potential consequences that lie within the Rwanda scheme. Reform UK's 'Safeguarding the Union' contains a lie in paragraph 46, where it states: \"The Windsor Framework applies only in respect of the trade in goods\" Strict limits on immigration are the only way to relieve the pressure on our housing, public services, increase wages and protect our culture, identity and values. Essential skills, mainly around healthcare, must be the only exception. This would boost wages and could raise more than £20 billion over five years. This would raise wages and raise",
    "UUP": "Controlled Immigration is important to all countries across the world. In the UK it has helped create a skilled workforce. Many doctors, nurses and other health care professionals come from other countries. Northern Ireland is also heavily reliant on ethnic minorities from others to carry out highly intensive manual jobs within the agri-food industry. Increase the number of staff working on asylum applications threefold to allow genuine asylum seekers to receive their application decision quicker and when granted to integrate fully into UK society. There are a minority of people in Northern Ireland that feel threatened by multi-cultural diversity and are intimidating those from differing ethnic backgrounds. The Ulster Unionist Party will work across civic society and support the police to end this unacceptable behaviour."
}