{
    "Alliance": "British Irish Council should now have a much wider role in enhancing and managing British- Irish relations. There are opportunities to further develop cooperation in areas such as energy, the environment, public health, education, trade, and transport. We believe there is scope for a shift in taxation related to environmental protection, including carbon taxes.",
    "Conservative": "Savings from our new plan for Euston have freed up £6.5 billion for transport across the rest of the country. Labour has no plan. They neither support the second phase of HS2 nor our alternative package of investment. Back our city regions with an additional £8.55 billion to spend on their local priorities. We are committed to all the schemes set out in the Network North Command Paper. This comes on top of £44 billion of funding for Network Rail over the next fve years and our investment in the Transpennine Route Upgrade. We have invested £40 billion in England’s strategic roads between 2015 and 2025. These changes will speed up local and national infrastructure planning systems. Ensure any requirements to offset impact of new infrastructure and homes on an area are proportionate, without compromising environmental outcomes. Reduce cost of infrastructure by allowing quicker changes to consented projects.",
    "DUP": "The DUP supports a uniform method for household waste collection in Northern Ireland. We support keeping it simple to collect the highest recycling volumes. This reduces cost for the taxpayer, drives higher volumes in recycling and promotes investment in the private sector. The Union Connectivity Review recommended that the Government support the Executive in developing, funding and implementing a long-term pipeline of improvements to transport infrastructure. The Government has provided £. Million to Translink to deliver a study on the cost, feasibility and value for money of electrification of the railway in Northern Ireland from Belfast to the border with the Irish Republic. A strengthened National Infrastructure Commission, with increased regional representation and fairer access to its skills and expertise for Northern Ireland, can play a key role. The DUP is committed to strengthening Northern Ireland’s air connectivity with Great Britain and internationally. Our MPs have also campaigned extensively for a solution which allows the reinstatement of duty-free shopping for flights between NI and the EU. Preventing airports and businesses in Northern Ireland from accessing this revenue stream is unfair and places them at a competitive disadvantage to the rest of the UK.",
    "Green": "Every £1 invested in bus services is estimated to bring an economic return of £4.50. Elected Greens would push for local authority control and proper funding for bus services. Cities and sparsely populated rural areas will need different solutions. Greens will oppose all new road building plans. Within a decade we want to see all petrol and diesel vehicles replaced by Electric Vehicles (EVs) We would push for an extensive vehicle scrappage scheme to support this rapid transition to EVs. Aviation is one of the fastest growing sources of global carbon emissions. Just 1% of the world’s population accounts for more than half of the CO2 emissions from passenger air travel. Green MPs will campaign for: • A frequent-flyer levy to reduce the impact of the 15% of people who take 70% of flights.",
    "Labour": "The potholes cratering our roads are a visible sign of the decline after 14 years of Conservative rule. We will maintain and renew our road network, to ensure it serves drivers, cyclists and other road users, remains safe, and tackles congestion. Labour will further support drivers by tackling the soaring cost of car insurance. Labour will create a long-term strategy for transport, ensuring transport infrastructure can be delivered efficiently and on time. Labour will ensure our industrial strategy supports the development of the Artificial Intelligence (AI) sector, removes planning barriers to new datacentres. We will work with universities to support spinouts; and work with industry to ensure start-ups have access to finance they need to grow. Reform of the British Business Bank will make it easier for small and medium sized enterprises to access capital. We will also reform procurement rules to give them greater access to government contracts. The Post Office is an essential service in communities across the country.",
    "LibDem": "Conservative Ministers have badly neglected our transport infrastructure. They have failed to rollout electric charging points at anything like the speed necessary. Roads are in a terrible state, with potholes everywhere. By investing in electric vehicles and clean public transport, Liberal Democrats will enhance local, regional and national connectivity. • Replacing multiple funding streams with one integrated fund for local authorities for expanding bus services and switching to zero-emission vehicles. • Urgently establishing a new Railway Agency: a public body which would help to join up the industry – from track to train. Banning short domestic flights where a direct rail option taking less than 2.5 hours is available for the same journey unless planes are alternative-fuelled. Placing a moratorium on net airport expansion until a national capacity and emissions management framework is in place.",
    "PlaidCymru": "Fairness for Transport Plaid Cymru demands that Wales receives £4bn of transport funding to which it is entitled under the Barnett Formula. Only 1% of UK Government capital spend is on railways in Wales. Wales needs an ambitious travel plan that also considers public transport connections in the south Wales Valleys and other areas of Wales which do not have existing rail connections. New housing developments around Wales need to show they have sufficiently future-proofed for growth in public transport. Bus services have been under-funded by the Labour Welsh Government following Covid, leading to major cuts in the past year. In particular, local bus services are already infrequent, often finishing early in the day. We will review the cuts in subsidy to bus companies that has led to services cuts that make it difficult for people to go to work, shop or catch up with friends by bus. Plaid Cymru supports investment in active travel routes. The need to change the way we travel is abundantly clear. Air pollution leads to an increase in asthma and lung conditions amongst children. We support clear air zones near major centres of population.",
    "Reform": "Reform UK will take a pragmatic approach to getting Britain’s infrastructure back on its feet. Save £25 billion by scrapping the rest of this bloated vanity project. Stop the War on Drivers Legislate to ban ULEZ Clean Air Zones and Low Traffic Neighbourhoods. Simplify the funding process to save time, cut waste, boost funding and accountability. TRANSPORT AND UTILITIES INFRASTRUCTURE The Scandal of our Crumbling Infrastructure Must End “Reform UK has the vision to transform Britain’s broken infrastructure.",
    "SDLP": "The SDLP has been at the forefront of campaigning for more ambitious infrastructure plans to stimulate economic growth, improve people’s quality of life & safety and ensure a sustainable future for all. Working alongside the SDLP Opposition at Stormont, SDLP MPs will: 1. Seek investment in public transport Investing in our public transport network is a crucial lever to help combat the climate emergency and create sustainable communities across the North. The SDLP will continue to raise safety concerns & signalisation of Caw Roundabout and advocate for the front-loading of these essential works. We will seek an update on the Phase 3 of Derry to Coleraine Feasibility Study and ensure Derry has fair, accessible rail provision to include hourly Sunday services. The Executive has failed to get a handle on the situation, leaving Northern Ireland far behind UK and South of Ireland counterparts in terms of flood forecasting. By improving warning systems, we can ensure communities are better prepared for flooding events.",
    "SinnFein": "We are also committed to delivering the flagship projects committed to by the Executive.",
    "SNP": "Under the SNP huge improvements have been made to our transport system. We’ve scrapped bridge tolls, invested over £11bn on rail infrastructure, brought Scotland’s railway into public hands and removed peak fares. But our ambition is constrained by resources and powers controlled by Westminster. Westminster’s cuts to capital funding have disrupted longer term investment. In the UK Spring Budget, the Tories cut capital yet again. This time by almost 9% – or a cumulative loss of £1.3bn by 2027/28.",
    "TUV": "",
    "UUP": ""
}